RT-Thread/rt-thread/bsp/Infineon/libraries/IFX_PSOC6_HAL/mtb-hal-cat1/COMPONENT_CAT1C/source/pin_packages/cyhal_xmc7200_272_bga.c
/* Connections for: cpuss_swj_swo_tdo */
const cyhal_resource_pin_mapping_t cyhal_pin_map_cpuss_swj_swo_tdo[1] = {
    {0u, 0u, P23_4, P23_4_CPUSS_SWJ_SWO_TDO},
};

/* Connections for: cpuss_swj_trstn */
const cyhal_resource_pin_mapping_t cyhal_pin_map_cpuss_swj_trstn[1] = {
    {0u, 0u, P2_0, P2_0_CPUSS_SWJ_TRSTN},
};

/* Connections for: cpuss_trace_clock */
const cyhal_resource_pin_mapping_t cyhal_pin_map_cpuss_trace_clock[2] = {
    {0u, 0u, P18_3, P18_3_CPUSS_TRACE_CLOCK},
    {0u, 0u, P22_4, P22_4_CPUSS_TRACE_CLOCK},
};

/* Connections for: cpuss_trace_data */
const cyhal_resource_pin_mapping_t cyhal_pin_map_cpuss_trace_data[8] = {
    {0u, 0u, P18_4, P18_4_CPUSS_TRACE_DATA0},
    {0u, 1u, P18_5, P18_5_CPUSS_TRACE_DATA1},
    {0u, 2u, P18_6, P18_6_CPUSS_TRACE_DATA2},
    {0u, 3u, P18_7, P18_7_CPUSS_TRACE_DATA3},
    {0u, 0u, P21_5, P21_5_CPUSS_TRACE_DATA0},
    {0u, 1u, P22_1, P22_1_CPUSS_TRACE_DATA1},
    {0u, 2u, P22_2, P22_2_CPUSS_TRACE_DATA2},
    {0u, 3u, P22_3, P22_3_CPUSS_TRACE_DATA3},
};

/* Connections for: eth_eth_tsu_timer_cmp_val */
const cyhal_resource_pin_mapping_t cyhal_pin_map_eth_eth_tsu_timer_cmp_val[2] = {
    {0u, 0u, P2_3, P2_3_ETH0_ETH_TSU_TIMER_CMP_VAL},
    {1u, 0u, P27_7, P27_7_ETH1_ETH_TSU_TIMER_CMP_VAL},
};

/* Connections for: eth_mdc */
const cyhal_resource_pin_mapping_t cyhal_pin_map_eth_mdc[2] = {
    {0u, 0u, P3_1, P3_1_ETH0_MDC},
    {1u, 0u, P27_6, P27_6_ETH1_MDC},
};

/* Connections for: eth_mdio */
const cyhal_resource_pin_mapping_t cyhal_pin_map_eth_mdio[2] = {
    {0u, 0u, P3_0, P3_0_ETH0_MDIO},
    {1u, 0u, P27_5, P27_5_ETH1_MDIO},
};

/* Connections for: eth_ref_clk */
const cyhal_resource_pin_mapping_t cyhal_pin_map_eth_ref_clk[2] = {
    {0u, 0u, P18_0, P18_0_ETH0_REF_CLK},
    {1u, 0u, P26_0, P26_0_ETH1_REF_CLK},
};

/* Connections for: eth_rx_clk */
const cyhal_resource_pin_mapping_t cyhal_pin_map_eth_rx_clk[2] = {
    {0u, 0u, P23_3, P23_3_ETH0_RX_CLK},
    {1u, 0u, P27_4, P27_4_ETH1_RX_CLK},
};

/* Connections for: eth_rx_ctl */
const cyhal_resource_pin_mapping_t cyhal_pin_map_eth_rx_ctl[2] = {
    {0u, 0u, P21_5, P21_5_ETH0_RX_CTL},
    {1u, 0u, P27_3, P27_3_ETH1_RX_CTL},
};

/* Connections for: eth_rx_er */
const cyhal_resource_pin_mapping_t cyhal_pin_map_eth_rx_er[1] = {
    {0u, 0u, P2_2, P2_2_ETH0_RX_ER},
};

/* Connections for: eth_rxd */
const cyhal_resource_pin_mapping_t cyhal_pin_map_eth_rxd[8] = {
    {0u, 0u, P19_0, P19_0_ETH0_RXD0},
    {0u, 1u, P19_1, P19_1_ETH0_RXD1},
    {0u, 2u, P19_2, P19_2_ETH0_RXD2},
    {0u, 3u, P19_3, P19_3_ETH0_RXD3},
    {1u, 0u, P26_7, P26_7_ETH1_RXD0},
    {1u, 1u, P27_0, P27_0_ETH1_RXD1},
    {1u, 2u, P27_1, P27_1_ETH1_RXD2},
    {1u, 3u, P27_2, P27_2_ETH1_RXD3},
};

/* Connections for: eth_tx_clk */
const cyhal_resource_pin_mapping_t cyhal_pin_map_eth_tx_clk[2] = {
    {0u, 0u, P18_3, P18_3_ETH0_TX_CLK},
    {1u, 0u, P26_2, P26_2_ETH1_TX_CLK},
};

/* Connections for: eth_tx_ctl */
const cyhal_resource_pin_mapping_t cyhal_pin_map_eth_tx_ctl[2] = {
    {0u, 0u, P18_1, P18_1_ETH0_TX_CTL},
    {1u, 0u, P26_1, P26_1_ETH1_TX_CTL},
};

/* Connections for: eth_tx_er */
const cyhal_resource_pin_mapping_t cyhal_pin_map_eth_tx_er[1] = {
    {0u, 0u, P18_2, P18_2_ETH0_TX_ER},
};

/* Connections for: eth_txd */
const cyhal_resource_pin_mapping_t cyhal_pin_map_eth_txd[8] = {
    {0u, 0u, P18_4, P18_4_ETH0_TXD0},
    {0u, 1u, P18_5, P18_5_ETH0_TXD1},
    {0u, 2u, P18_6, P18_6_ETH0_TXD2},
    {0u, 3u, P18_7, P18_7_ETH0_TXD3},
    {1u, 0u, P26_3, P26_3_ETH1_TXD0},
    {1u, 1u, P26_4, P26_4_ETH1_TXD1},
    {1u, 2u, P26_5, P26_5_ETH1_TXD2},
    {1u, 3u, P26_6, P26_6_ETH1_TXD3},
};

/* Connections for: flexray_rxda */
const cyhal_resource_pin_mapping_t cyhal_pin_map_flexray_rxda[1] = {
    {0u, 0u, P10_2, P10_2_FLEXRAY0_RXDA},
};

/* Connections for: flexray_rxdb */
const cyhal_resource_pin_mapping_t cyhal_pin_map_flexray_rxdb[1] = {
    {0u, 0u, P10_5, P10_5_FLEXRAY0_RXDB},
};

/* Connections for: flexray_txda */
const cyhal_resource_pin_mapping_t cyhal_pin_map_flexray_txda[1] = {
    {0u, 0u, P10_3, P10_3_FLEXRAY0_TXDA},
};

/* Connections for: flexray_txdb */
const cyhal_resource_pin_mapping_t cyhal_pin_map_flexray_txdb[1] = {
    {0u, 0u, P10_6, P10_6_FLEXRAY0_TXDB},
};

/* Connections for: flexray_txena_n */
const cyhal_resource_pin_mapping_t cyhal_pin_map_flexray_txena_n[1] = {
    {0u, 0u, P10_4, P10_4_FLEXRAY0_TXENA_N},
};

/* Connections for: flexray_txenb_n */
const cyhal_resource_pin_mapping_t cyhal_pin_map_flexray_txenb_n[1] = {
    {0u, 0u, P10_7, P10_7_FLEXRAY0_TXENB_N},
};

/* Connections for: lin_lin_en */
const cyhal_resource_pin_mapping_t cyhal_pin_map_lin_lin_en[38] = {
    {0u, 1u, P0_2, P0_2_LIN0_LIN_EN1},
    {0u, 0u, P2_2, P2_2_LIN0_LIN_EN0},
    {0u, 5u, P2_5, P2_5_LIN0_LIN_EN5},
    {0u, 11u, P3_7, P3_7_LIN0_LIN_EN11},
    {0u, 1u, P4_2, P4_2_LIN0_LIN_EN1},
    {0u, 7u, P5_2, P5_2_LIN0_LIN_EN7},
    {0u, 2u, P5_5, P5_5_LIN0_LIN_EN2},
    {0u, 9u, P6_0, P6_0_LIN0_LIN_EN9},
    {0u, 3u, P6_2, P6_2_LIN0_LIN_EN3},
    {0u, 4u, P6_5, P6_5_LIN0_LIN_EN4},
    {0u, 4u, P7_2, P7_2_LIN0_LIN_EN4},
    {0u, 10u, P7_7, P7_7_LIN0_LIN_EN10},
    {0u, 2u, P8_2, P8_2_LIN0_LIN_EN2},
    {0u, 16u, P9_0, P9_0_LIN0_LIN_EN16},
    {0u, 12u, P9_3, P9_3_LIN0_LIN_EN12},
    {0u, 8u, P10_4, P10_4_LIN0_LIN_EN8},
    {0u, 13u, P10_7, P10_7_LIN0_LIN_EN13},
    {0u, 6u, P12_1, P12_1_LIN0_LIN_EN6},
    {0u, 3u, P13_2, P13_2_LIN0_LIN_EN3},
    {0u, 8u, P13_6, P13_6_LIN0_LIN_EN8},
    {0u, 6u, P14_4, P14_4_LIN0_LIN_EN6},
    {0u, 14u, P14_7, P14_7_LIN0_LIN_EN14},
    {0u, 11u, P16_2, P16_2_LIN0_LIN_EN11},
    {0u, 11u, P17_2, P17_2_LIN0_LIN_EN11},
    {0u, 15u, P17_7, P17_7_LIN0_LIN_EN15},
    {0u, 5u, P20_2, P20_2_LIN0_LIN_EN5},
    {0u, 0u, P21_7, P21_7_LIN0_LIN_EN0},
    {0u, 7u, P22_7, P22_7_LIN0_LIN_EN7},
    {0u, 9u, P23_7, P23_7_LIN0_LIN_EN9},
    {0u, 16u, P24_4, P24_4_LIN0_LIN_EN16},
    {0u, 17u, P28_3, P28_3_LIN0_LIN_EN17},
    {0u, 18u, P28_6, P28_6_LIN0_LIN_EN18},
    {0u, 19u, P29_1, P29_1_LIN0_LIN_EN19},
    {0u, 16u, P30_3, P30_3_LIN0_LIN_EN16},
    {0u, 17u, P31_2, P31_2_LIN0_LIN_EN17},
    {0u, 18u, P32_4, P32_4_LIN0_LIN_EN18},
    {0u, 10u, P32_6, P32_6_LIN0_LIN_EN10},
    {0u, 19u, P32_7, P32_7_LIN0_LIN_EN19},
};

/* Connections for: lin_lin_rx */
const cyhal_resource_pin_mapping_t cyhal_pin_map_lin_lin_rx[49] = {
    {0u, 1u, P0_0, P0_0_LIN0_LIN_RX1},
    {0u, 0u, P1_2, P1_2_LIN0_LIN_RX0},
    {0u, 8u, P1_4, P1_4_LIN0_LIN_RX8},
    {0u, 0u, P2_0, P2_0_LIN0_LIN_RX0},
    {0u, 5u, P2_3, P2_3_LIN0_LIN_RX5},
    {0u, 11u, P2_7, P2_7_LIN0_LIN_RX11},
    {0u, 1u, P3_4, P3_4_LIN0_LIN_RX1},
    {0u, 1u, P4_0, P4_0_LIN0_LIN_RX1},
    {0u, 15u, P4_4, P4_4_LIN0_LIN_RX15},
    {0u, 7u, P5_0, P5_0_LIN0_LIN_RX7},
    {0u, 10u, P5_2, P5_2_LIN0_LIN_RX10},
    {0u, 2u, P5_3, P5_3_LIN0_LIN_RX2},
    {0u, 9u, P5_4, P5_4_LIN0_LIN_RX9},
    {0u, 3u, P6_0, P6_0_LIN0_LIN_RX3},
    {0u, 4u, P6_3, P6_3_LIN0_LIN_RX4},
    {0u, 4u, P7_0, P7_0_LIN0_LIN_RX4},
    {0u, 10u, P7_5, P7_5_LIN0_LIN_RX10},
    {0u, 2u, P8_0, P8_0_LIN0_LIN_RX2},
    {0u, 16u, P8_3, P8_3_LIN0_LIN_RX16},
    {0u, 12u, P9_1, P9_1_LIN0_LIN_RX12},
    {0u, 7u, P10_0, P10_0_LIN0_LIN_RX7},
    {0u, 8u, P10_2, P10_2_LIN0_LIN_RX8},
    {0u, 13u, P10_5, P10_5_LIN0_LIN_RX13},
    {0u, 6u, P12_2, P12_2_LIN0_LIN_RX6},
    {0u, 3u, P13_0, P13_0_LIN0_LIN_RX3},
    {0u, 2u, P13_3, P13_3_LIN0_LIN_RX2},
    {0u, 8u, P13_4, P13_4_LIN0_LIN_RX8},
    {0u, 6u, P14_2, P14_2_LIN0_LIN_RX6},
    {0u, 14u, P14_5, P14_5_LIN0_LIN_RX14},
    {0u, 11u, P16_0, P16_0_LIN0_LIN_RX11},
    {0u, 11u, P17_0, P17_0_LIN0_LIN_RX11},
    {0u, 15u, P17_5, P17_5_LIN0_LIN_RX15},
    {0u, 12u, P17_7, P17_7_LIN0_LIN_RX12},
    {0u, 5u, P20_0, P20_0_LIN0_LIN_RX5},
    {0u, 0u, P21_5, P21_5_LIN0_LIN_RX0},
    {0u, 13u, P21_6, P21_6_LIN0_LIN_RX13},
    {0u, 7u, P22_5, P22_5_LIN0_LIN_RX7},
    {0u, 14u, P22_7, P22_7_LIN0_LIN_RX14},
    {0u, 6u, P23_2, P23_2_LIN0_LIN_RX6},
    {0u, 9u, P23_5, P23_5_LIN0_LIN_RX9},
    {0u, 16u, P24_0, P24_0_LIN0_LIN_RX16},
    {0u, 17u, P28_1, P28_1_LIN0_LIN_RX17},
    {0u, 18u, P28_4, P28_4_LIN0_LIN_RX18},
    {0u, 19u, P28_7, P28_7_LIN0_LIN_RX19},
    {0u, 16u, P30_1, P30_1_LIN0_LIN_RX16},
    {0u, 17u, P31_0, P31_0_LIN0_LIN_RX17},
    {0u, 18u, P32_2, P32_2_LIN0_LIN_RX18},
    {0u, 10u, P32_4, P32_4_LIN0_LIN_RX10},
    {0u, 19u, P32_5, P32_5_LIN0_LIN_RX19},
};

/* Connections for: lin_lin_tx */
const cyhal_resource_pin_mapping_t cyhal_pin_map_lin_lin_tx[48] = {
    {0u, 1u, P0_1, P0_1_LIN0_LIN_TX1},
    {0u, 0u, P1_3, P1_3_LIN0_LIN_TX0},
    {0u, 0u, P2_1, P2_1_LIN0_LIN_TX0},
    {0u, 5u, P2_4, P2_4_LIN0_LIN_TX5},
    {0u, 1u, P3_5, P3_5_LIN0_LIN_TX1},
    {0u, 11u, P3_6, P3_6_LIN0_LIN_TX11},
    {0u, 1u, P4_1, P4_1_LIN0_LIN_TX1},
    {0u, 15u, P5_0, P5_0_LIN0_LIN_TX15},
    {0u, 7u, P5_1, P5_1_LIN0_LIN_TX7},
    {0u, 10u, P5_3, P5_3_LIN0_LIN_TX10},
    {0u, 2u, P5_4, P5_4_LIN0_LIN_TX2},
    {0u, 9u, P5_5, P5_5_LIN0_LIN_TX9},
    {0u, 3u, P6_1, P6_1_LIN0_LIN_TX3},
    {0u, 4u, P6_4, P6_4_LIN0_LIN_TX4},
    {0u, 4u, P7_1, P7_1_LIN0_LIN_TX4},
    {0u, 10u, P7_6, P7_6_LIN0_LIN_TX10},
    {0u, 2u, P8_1, P8_1_LIN0_LIN_TX2},
    {0u, 16u, P8_4, P8_4_LIN0_LIN_TX16},
    {0u, 12u, P9_2, P9_2_LIN0_LIN_TX12},
    {0u, 7u, P10_1, P10_1_LIN0_LIN_TX7},
    {0u, 8u, P10_3, P10_3_LIN0_LIN_TX8},
    {0u, 13u, P10_6, P10_6_LIN0_LIN_TX13},
    {0u, 6u, P12_3, P12_3_LIN0_LIN_TX6},
    {0u, 3u, P13_1, P13_1_LIN0_LIN_TX3},
    {0u, 2u, P13_4, P13_4_LIN0_LIN_TX2},
    {0u, 8u, P13_5, P13_5_LIN0_LIN_TX8},
    {0u, 6u, P14_3, P14_3_LIN0_LIN_TX6},
    {0u, 14u, P14_6, P14_6_LIN0_LIN_TX14},
    {0u, 11u, P16_1, P16_1_LIN0_LIN_TX11},
    {0u, 11u, P17_1, P17_1_LIN0_LIN_TX11},
    {0u, 15u, P17_6, P17_6_LIN0_LIN_TX15},
    {0u, 12u, P18_0, P18_0_LIN0_LIN_TX12},
    {0u, 5u, P20_1, P20_1_LIN0_LIN_TX5},
    {0u, 0u, P21_6, P21_6_LIN0_LIN_TX0},
    {0u, 13u, P21_7, P21_7_LIN0_LIN_TX13},
    {0u, 7u, P22_6, P22_6_LIN0_LIN_TX7},
    {0u, 14u, P23_0, P23_0_LIN0_LIN_TX14},
    {0u, 6u, P23_3, P23_3_LIN0_LIN_TX6},
    {0u, 9u, P23_6, P23_6_LIN0_LIN_TX9},
    {0u, 16u, P24_3, P24_3_LIN0_LIN_TX16},
    {0u, 17u, P28_2, P28_2_LIN0_LIN_TX17},
    {0u, 18u, P28_5, P28_5_LIN0_LIN_TX18},
    {0u, 19u, P29_0, P29_0_LIN0_LIN_TX19},
    {0u, 16u, P30_2, P30_2_LIN0_LIN_TX16},
    {0u, 17u, P31_1, P31_1_LIN0_LIN_TX17},
    {0u, 18u, P32_3, P32_3_LIN0_LIN_TX18},
    {0u, 10u, P32_5, P32_5_LIN0_LIN_TX10},
    {0u, 19u, P32_6, P32_6_LIN0_LIN_TX19},
};

