RT-Thread/rt-thread/bsp/Infineon/libraries/IFX_PSOC6_HAL/mtb-hal-cat1/COMPONENT_CAT1C/source/pin_packages/cyhal_xmc7200_272_bga.c
/* Connections for: scb_uart_rts */
const cyhal_resource_pin_mapping_t cyhal_pin_map_scb_uart_rts[20] = {
    {0u, 0u, P0_2, P0_2_SCB0_UART_RTS},
    {7u, 0u, P2_2, P2_2_SCB7_UART_RTS},
    {6u, 0u, P3_2, P3_2_SCB6_UART_RTS},
    {5u, 0u, P4_2, P4_2_SCB5_UART_RTS},
    {4u, 0u, P6_2, P6_2_SCB4_UART_RTS},
    {5u, 0u, P7_2, P7_2_SCB5_UART_RTS},
    {4u, 0u, P10_2, P10_2_SCB4_UART_RTS},
    {8u, 0u, P12_2, P12_2_SCB8_UART_RTS},
    {3u, 0u, P13_2, P13_2_SCB3_UART_RTS},
    {2u, 0u, P14_2, P14_2_SCB2_UART_RTS},
    {9u, 0u, P15_2, P15_2_SCB9_UART_RTS},
    {3u, 0u, P17_3, P17_3_SCB3_UART_RTS},
    {1u, 0u, P18_2, P18_2_SCB1_UART_RTS},
    {2u, 0u, P19_2, P19_2_SCB2_UART_RTS},
    {1u, 0u, P20_5, P20_5_SCB1_UART_RTS},
    {6u, 0u, P22_2, P22_2_SCB6_UART_RTS},
    {7u, 0u, P23_2, P23_2_SCB7_UART_RTS},
    {10u, 0u, P28_2, P28_2_SCB10_UART_RTS},
    {9u, 0u, P30_0, P30_0_SCB9_UART_RTS},
    {10u, 0u, P32_2, P32_2_SCB10_UART_RTS},
};

/* Connections for: scb_uart_rx */
const cyhal_resource_pin_mapping_t cyhal_pin_map_scb_uart_rx[20] = {
    {0u, 0u, P0_0, P0_0_SCB0_UART_RX},
    {8u, 0u, P1_4, P1_4_SCB8_UART_RX},
    {7u, 0u, P2_0, P2_0_SCB7_UART_RX},
    {6u, 0u, P3_0, P3_0_SCB6_UART_RX},
    {5u, 0u, P4_0, P4_0_SCB5_UART_RX},
    {4u, 0u, P6_0, P6_0_SCB4_UART_RX},
    {5u, 0u, P7_0, P7_0_SCB5_UART_RX},
    {4u, 0u, P10_0, P10_0_SCB4_UART_RX},
    {8u, 0u, P12_0, P12_0_SCB8_UART_RX},
    {3u, 0u, P13_0, P13_0_SCB3_UART_RX},
    {2u, 0u, P14_0, P14_0_SCB2_UART_RX},
    {9u, 0u, P15_0, P15_0_SCB9_UART_RX},
    {3u, 0u, P17_1, P17_1_SCB3_UART_RX},
    {1u, 0u, P18_0, P18_0_SCB1_UART_RX},
    {2u, 0u, P19_0, P19_0_SCB2_UART_RX},
    {1u, 0u, P20_3, P20_3_SCB1_UART_RX},
    {6u, 0u, P21_7, P21_7_SCB6_UART_RX},
    {7u, 0u, P23_0, P23_0_SCB7_UART_RX},
    {10u, 0u, P28_0, P28_0_SCB10_UART_RX},
    {10u, 0u, P32_0, P32_0_SCB10_UART_RX},
};

/* Connections for: scb_uart_tx */
const cyhal_resource_pin_mapping_t cyhal_pin_map_scb_uart_tx[19] = {
    {0u, 0u, P0_1, P0_1_SCB0_UART_TX},
    {7u, 0u, P2_1, P2_1_SCB7_UART_TX},
    {6u, 0u, P3_1, P3_1_SCB6_UART_TX},
    {5u, 0u, P4_1, P4_1_SCB5_UART_TX},
    {4u, 0u, P6_1, P6_1_SCB4_UART_TX},
    {5u, 0u, P7_1, P7_1_SCB5_UART_TX},
    {4u, 0u, P10_1, P10_1_SCB4_UART_TX},
    {8u, 0u, P12_1, P12_1_SCB8_UART_TX},
    {3u, 0u, P13_1, P13_1_SCB3_UART_TX},
    {2u, 0u, P14_1, P14_1_SCB2_UART_TX},
    {9u, 0u, P15_1, P15_1_SCB9_UART_TX},
    {3u, 0u, P17_2, P17_2_SCB3_UART_TX},
    {1u, 0u, P18_1, P18_1_SCB1_UART_TX},
    {2u, 0u, P19_1, P19_1_SCB2_UART_TX},
    {1u, 0u, P20_4, P20_4_SCB1_UART_TX},
    {6u, 0u, P22_1, P22_1_SCB6_UART_TX},
    {7u, 0u, P23_1, P23_1_SCB7_UART_TX},
    {10u, 0u, P28_1, P28_1_SCB10_UART_TX},
    {10u, 0u, P32_1, P32_1_SCB10_UART_TX},
};

/* Connections for: sdhc_card_cmd */
const cyhal_resource_pin_mapping_t cyhal_pin_map_sdhc_card_cmd[2] = {
    {0u, 0u, P6_3, P6_3_SDHC0_CARD_CMD},
    {0u, 0u, P24_3, P24_3_SDHC0_CARD_CMD},
};

/* Connections for: sdhc_card_dat_3to0 */
const cyhal_resource_pin_mapping_t cyhal_pin_map_sdhc_card_dat_3to0[8] = {
    {0u, 0u, P7_1, P7_1_SDHC0_CARD_DAT_3TO00},
    {0u, 1u, P7_2, P7_2_SDHC0_CARD_DAT_3TO01},
    {0u, 2u, P7_3, P7_3_SDHC0_CARD_DAT_3TO02},
    {0u, 3u, P7_4, P7_4_SDHC0_CARD_DAT_3TO03},
    {0u, 0u, P25_0, P25_0_SDHC0_CARD_DAT_3TO00},
    {0u, 1u, P25_1, P25_1_SDHC0_CARD_DAT_3TO01},
    {0u, 2u, P25_2, P25_2_SDHC0_CARD_DAT_3TO02},
    {0u, 3u, P25_3, P25_3_SDHC0_CARD_DAT_3TO03},
};

/* Connections for: sdhc_card_dat_7to4 */
const cyhal_resource_pin_mapping_t cyhal_pin_map_sdhc_card_dat_7to4[8] = {
    {0u, 0u, P7_5, P7_5_SDHC0_CARD_DAT_7TO40},
    {0u, 1u, P8_0, P8_0_SDHC0_CARD_DAT_7TO41},
    {0u, 2u, P8_1, P8_1_SDHC0_CARD_DAT_7TO42},
    {0u, 3u, P8_2, P8_2_SDHC0_CARD_DAT_7TO43},
    {0u, 0u, P25_4, P25_4_SDHC0_CARD_DAT_7TO40},
    {0u, 1u, P25_5, P25_5_SDHC0_CARD_DAT_7TO41},
    {0u, 2u, P25_6, P25_6_SDHC0_CARD_DAT_7TO42},
    {0u, 3u, P25_7, P25_7_SDHC0_CARD_DAT_7TO43},
};

/* Connections for: sdhc_card_detect_n */
const cyhal_resource_pin_mapping_t cyhal_pin_map_sdhc_card_detect_n[2] = {
    {0u, 0u, P6_5, P6_5_SDHC0_CARD_DETECT_N},
    {0u, 0u, P24_0, P24_0_SDHC0_CARD_DETECT_N},
};

/* Connections for: sdhc_card_if_pwr_en */
const cyhal_resource_pin_mapping_t cyhal_pin_map_sdhc_card_if_pwr_en[2] = {
    {0u, 0u, P7_0, P7_0_SDHC0_CARD_IF_PWR_EN},
    {0u, 0u, P24_4, P24_4_SDHC0_CARD_IF_PWR_EN},
};

/* Connections for: sdhc_card_mech_write_prot */
const cyhal_resource_pin_mapping_t cyhal_pin_map_sdhc_card_mech_write_prot[2] = {
    {0u, 0u, P6_2, P6_2_SDHC0_CARD_MECH_WRITE_PROT},
    {0u, 0u, P24_1, P24_1_SDHC0_CARD_MECH_WRITE_PROT},
};

/* Connections for: sdhc_clk_card */
const cyhal_resource_pin_mapping_t cyhal_pin_map_sdhc_clk_card[2] = {
    {0u, 0u, P6_4, P6_4_SDHC0_CLK_CARD},
    {0u, 0u, P24_2, P24_2_SDHC0_CLK_CARD},
};

/* Connections for: smif_spi_clk */
const cyhal_resource_pin_mapping_t cyhal_pin_map_smif_spi_clk[2] = {
    {0u, 0u, P6_3, P6_3_SMIF0_SPIHB_CLK},
    {0u, 0u, P24_1, P24_1_SMIF0_SPIHB_CLK},
};

/* Connections for: smif_spi_data0 */
const cyhal_resource_pin_mapping_t cyhal_pin_map_smif_spi_data0[2] = {
    {0u, 0u, P7_1, P7_1_SMIF0_SPIHB_DATA0},
    {0u, 0u, P25_0, P25_0_SMIF0_SPIHB_DATA0},
};

/* Connections for: smif_spi_data1 */
const cyhal_resource_pin_mapping_t cyhal_pin_map_smif_spi_data1[2] = {
    {0u, 0u, P7_2, P7_2_SMIF0_SPIHB_DATA1},
    {0u, 0u, P25_1, P25_1_SMIF0_SPIHB_DATA1},
};

/* Connections for: smif_spi_data2 */
const cyhal_resource_pin_mapping_t cyhal_pin_map_smif_spi_data2[2] = {
    {0u, 0u, P7_3, P7_3_SMIF0_SPIHB_DATA2},
    {0u, 0u, P25_2, P25_2_SMIF0_SPIHB_DATA2},
};

/* Connections for: smif_spi_data3 */
const cyhal_resource_pin_mapping_t cyhal_pin_map_smif_spi_data3[2] = {
    {0u, 0u, P7_4, P7_4_SMIF0_SPIHB_DATA3},
    {0u, 0u, P25_3, P25_3_SMIF0_SPIHB_DATA3},
};

/* Connections for: smif_spi_data4 */
const cyhal_resource_pin_mapping_t cyhal_pin_map_smif_spi_data4[2] = {
    {0u, 0u, P7_5, P7_5_SMIF0_SPIHB_DATA4},
    {0u, 0u, P25_4, P25_4_SMIF0_SPIHB_DATA4},
};

/* Connections for: smif_spi_data5 */
const cyhal_resource_pin_mapping_t cyhal_pin_map_smif_spi_data5[2] = {
    {0u, 0u, P8_0, P8_0_SMIF0_SPIHB_DATA5},
    {0u, 0u, P25_5, P25_5_SMIF0_SPIHB_DATA5},
};

