RT-Thread/rt-thread/bsp/Infineon/libraries/IFX_PSOC6_HAL/mtb-hal-cat1/COMPONENT_CAT1C/source/pin_packages/cyhal_xmc7200_272_bga.c
/* Connections for: smif_spi_data6 */
const cyhal_resource_pin_mapping_t cyhal_pin_map_smif_spi_data6[2] = {
    {0u, 0u, P8_1, P8_1_SMIF0_SPIHB_DATA6},
    {0u, 0u, P25_6, P25_6_SMIF0_SPIHB_DATA6},
};

/* Connections for: smif_spi_data7 */
const cyhal_resource_pin_mapping_t cyhal_pin_map_smif_spi_data7[2] = {
    {0u, 0u, P8_2, P8_2_SMIF0_SPIHB_DATA7},
    {0u, 0u, P25_7, P25_7_SMIF0_SPIHB_DATA7},
};

/* Connections for: smif_spi_rwds */
const cyhal_resource_pin_mapping_t cyhal_pin_map_smif_spi_rwds[2] = {
    {0u, 0u, P6_4, P6_4_SMIF0_SPIHB_RWDS},
    {0u, 0u, P24_2, P24_2_SMIF0_SPIHB_RWDS},
};

/* Connections for: smif_spi_select0 */
const cyhal_resource_pin_mapping_t cyhal_pin_map_smif_spi_select0[2] = {
    {0u, 0u, P6_5, P6_5_SMIF0_SPIHB_SELECT0},
    {0u, 0u, P24_3, P24_3_SMIF0_SPIHB_SELECT0},
};

/* Connections for: smif_spi_select1 */
const cyhal_resource_pin_mapping_t cyhal_pin_map_smif_spi_select1[2] = {
    {0u, 0u, P7_0, P7_0_SMIF0_SPIHB_SELECT1},
    {0u, 0u, P24_4, P24_4_SMIF0_SPIHB_SELECT1},
};

/* Connections for: tcpwm_line */
const cyhal_resource_pin_mapping_t cyhal_pin_map_tcpwm_line[227] = {
    {2u, 0u, P0_0, P0_0_TCPWM0_LINE512},
    {4u, 18u, P0_0, P0_0_TCPWM1_LINE18},
    {4u, 17u, P0_1, P0_1_TCPWM1_LINE17},
    {4u, 14u, P0_2, P0_2_TCPWM1_LINE14},
    {4u, 13u, P0_3, P0_3_TCPWM1_LINE13},
    {4u, 12u, P1_0, P1_0_TCPWM1_LINE12},
    {6u, 4u, P1_0, P1_0_TCPWM1_LINE516},
    {4u, 11u, P1_1, P1_1_TCPWM1_LINE11},
    {6u, 5u, P1_1, P1_1_TCPWM1_LINE517},
    {4u, 10u, P1_2, P1_2_TCPWM1_LINE10},
    {6u, 6u, P1_2, P1_2_TCPWM1_LINE518},
    {4u, 8u, P1_3, P1_3_TCPWM1_LINE8},
    {6u, 7u, P1_3, P1_3_TCPWM1_LINE519},
    {4u, 71u, P1_4, P1_4_TCPWM1_LINE71},
    {4u, 7u, P2_0, P2_0_TCPWM1_LINE7},
    {4u, 6u, P2_1, P2_1_TCPWM1_LINE6},
    {4u, 5u, P2_2, P2_2_TCPWM1_LINE5},
    {4u, 4u, P2_3, P2_3_TCPWM1_LINE4},
    {4u, 3u, P2_4, P2_4_TCPWM1_LINE3},
    {4u, 2u, P2_5, P2_5_TCPWM1_LINE2},
    {4u, 72u, P2_6, P2_6_TCPWM1_LINE72},
    {4u, 73u, P2_7, P2_7_TCPWM1_LINE73},
    {4u, 1u, P3_0, P3_0_TCPWM1_LINE1},
    {4u, 0u, P3_1, P3_1_TCPWM1_LINE0},
    {5u, 3u, P3_2, P3_2_TCPWM1_LINE259},
    {5u, 2u, P3_3, P3_3_TCPWM1_LINE258},
    {5u, 1u, P3_4, P3_4_TCPWM1_LINE257},
    {5u, 0u, P3_5, P3_5_TCPWM1_LINE256},
    {4u, 74u, P3_6, P3_6_TCPWM1_LINE74},
    {4u, 75u, P3_7, P3_7_TCPWM1_LINE75},
    {4u, 4u, P4_0, P4_0_TCPWM1_LINE4},
    {4u, 5u, P4_1, P4_1_TCPWM1_LINE5},
    {4u, 6u, P4_2, P4_2_TCPWM1_LINE6},
    {4u, 7u, P4_3, P4_3_TCPWM1_LINE7},
    {4u, 8u, P4_4, P4_4_TCPWM1_LINE8},
    {1u, 0u, P5_0, P5_0_TCPWM0_LINE256},
    {4u, 9u, P5_0, P5_0_TCPWM1_LINE9},
    {6u, 10u, P5_0, P5_0_TCPWM1_LINE522},
    {4u, 10u, P5_1, P5_1_TCPWM1_LINE10},
    {4u, 11u, P5_2, P5_2_TCPWM1_LINE11},
    {4u, 12u, P5_3, P5_3_TCPWM1_LINE12},
    {4u, 13u, P5_4, P5_4_TCPWM1_LINE13},
    {6u, 11u, P5_4, P5_4_TCPWM1_LINE523},
    {4u, 14u, P5_5, P5_5_TCPWM1_LINE14},
    {0u, 0u, P6_0, P6_0_TCPWM0_LINE0},
    {5u, 0u, P6_0, P6_0_TCPWM1_LINE256},
    {4u, 0u, P6_1, P6_1_TCPWM1_LINE0},
    {5u, 1u, P6_2, P6_2_TCPWM1_LINE257},
    {6u, 12u, P6_2, P6_2_TCPWM1_LINE524},
    {4u, 1u, P6_3, P6_3_TCPWM1_LINE1},
    {5u, 2u, P6_4, P6_4_TCPWM1_LINE258},
    {4u, 2u, P6_5, P6_5_TCPWM1_LINE2},
    {5u, 3u, P6_6, P6_6_TCPWM1_LINE259},
    {4u, 3u, P6_7, P6_7_TCPWM1_LINE3},
    {0u, 1u, P7_0, P7_0_TCPWM0_LINE1},
    {5u, 4u, P7_0, P7_0_TCPWM1_LINE260},
    {4u, 15u, P7_1, P7_1_TCPWM1_LINE15},
    {5u, 5u, P7_2, P7_2_TCPWM1_LINE261},
    {4u, 16u, P7_3, P7_3_TCPWM1_LINE16},
    {5u, 6u, P7_4, P7_4_TCPWM1_LINE262},
    {2u, 2u, P7_5, P7_5_TCPWM0_LINE514},
    {4u, 17u, P7_5, P7_5_TCPWM1_LINE17},
    {5u, 7u, P7_6, P7_6_TCPWM1_LINE263},
    {4u, 18u, P7_7, P7_7_TCPWM1_LINE18},
    {4u, 19u, P8_0, P8_0_TCPWM1_LINE19},
    {6u, 8u, P8_0, P8_0_TCPWM1_LINE520},
    {4u, 20u, P8_1, P8_1_TCPWM1_LINE20},
    {4u, 21u, P8_2, P8_2_TCPWM1_LINE21},
    {4u, 22u, P8_3, P8_3_TCPWM1_LINE22},
    {4u, 23u, P8_4, P8_4_TCPWM1_LINE23},
    {4u, 24u, P9_0, P9_0_TCPWM1_LINE24},
    {6u, 9u, P9_0, P9_0_TCPWM1_LINE521},
    {4u, 25u, P9_1, P9_1_TCPWM1_LINE25},
    {4u, 26u, P9_2, P9_2_TCPWM1_LINE26},
    {4u, 27u, P9_3, P9_3_TCPWM1_LINE27},
    {4u, 28u, P10_0, P10_0_TCPWM1_LINE28},
    {6u, 10u, P10_0, P10_0_TCPWM1_LINE522},
    {4u, 29u, P10_1, P10_1_TCPWM1_LINE29},
    {4u, 30u, P10_2, P10_2_TCPWM1_LINE30},
    {4u, 31u, P10_3, P10_3_TCPWM1_LINE31},
    {4u, 32u, P10_4, P10_4_TCPWM1_LINE32},
    {6u, 11u, P10_4, P10_4_TCPWM1_LINE523},
    {4u, 33u, P10_5, P10_5_TCPWM1_LINE33},
    {4u, 34u, P10_6, P10_6_TCPWM1_LINE34},
    {4u, 35u, P10_7, P10_7_TCPWM1_LINE35},
    {4u, 61u, P11_0, P11_0_TCPWM1_LINE61},
    {4u, 60u, P11_1, P11_1_TCPWM1_LINE60},
    {4u, 59u, P11_2, P11_2_TCPWM1_LINE59},
    {2u, 1u, P12_0, P12_0_TCPWM0_LINE513},
    {4u, 36u, P12_0, P12_0_TCPWM1_LINE36},
    {4u, 37u, P12_1, P12_1_TCPWM1_LINE37},
    {4u, 38u, P12_2, P12_2_TCPWM1_LINE38},
    {4u, 39u, P12_3, P12_3_TCPWM1_LINE39},
    {4u, 40u, P12_4, P12_4_TCPWM1_LINE40},
    {4u, 41u, P12_5, P12_5_TCPWM1_LINE41},
    {4u, 42u, P12_6, P12_6_TCPWM1_LINE42},
    {4u, 43u, P12_7, P12_7_TCPWM1_LINE43},
    {5u, 8u, P13_0, P13_0_TCPWM1_LINE264},
    {4u, 44u, P13_1, P13_1_TCPWM1_LINE44},
    {0u, 2u, P13_2, P13_2_TCPWM0_LINE2},
    {5u, 9u, P13_2, P13_2_TCPWM1_LINE265},
    {4u, 45u, P13_3, P13_3_TCPWM1_LINE45},
    {5u, 10u, P13_4, P13_4_TCPWM1_LINE266},
    {6u, 4u, P13_4, P13_4_TCPWM1_LINE516},
    {4u, 46u, P13_5, P13_5_TCPWM1_LINE46},
    {5u, 11u, P13_6, P13_6_TCPWM1_LINE267},
    {6u, 5u, P13_6, P13_6_TCPWM1_LINE517},
    {4u, 47u, P13_7, P13_7_TCPWM1_LINE47},
    {1u, 1u, P14_0, P14_0_TCPWM0_LINE257},
    {4u, 48u, P14_0, P14_0_TCPWM1_LINE48},
    {6u, 6u, P14_0, P14_0_TCPWM1_LINE518},
    {4u, 49u, P14_1, P14_1_TCPWM1_LINE49},
    {4u, 50u, P14_2, P14_2_TCPWM1_LINE50},
    {6u, 7u, P14_2, P14_2_TCPWM1_LINE519},
    {4u, 51u, P14_3, P14_3_TCPWM1_LINE51},
    {4u, 52u, P14_4, P14_4_TCPWM1_LINE52},
    {4u, 53u, P14_5, P14_5_TCPWM1_LINE53},
    {4u, 54u, P14_6, P14_6_TCPWM1_LINE54},
    {4u, 55u, P14_7, P14_7_TCPWM1_LINE55},
    {4u, 56u, P15_0, P15_0_TCPWM1_LINE56},
    {4u, 57u, P15_1, P15_1_TCPWM1_LINE57},
    {4u, 58u, P15_2, P15_2_TCPWM1_LINE58},
    {4u, 59u, P15_3, P15_3_TCPWM1_LINE59},
    {4u, 60u, P16_0, P16_0_TCPWM1_LINE60},
    {6u, 0u, P16_0, P16_0_TCPWM1_LINE512},
    {4u, 61u, P16_1, P16_1_TCPWM1_LINE61},
    {4u, 62u, P16_2, P16_2_TCPWM1_LINE62},
    {6u, 1u, P16_2, P16_2_TCPWM1_LINE513},
    {4u, 62u, P16_3, P16_3_TCPWM1_LINE62},
    {4u, 68u, P16_4, P16_4_TCPWM1_LINE68},
    {4u, 67u, P16_5, P16_5_TCPWM1_LINE67},
    {4u, 66u, P16_6, P16_6_TCPWM1_LINE66},
    {4u, 65u, P16_7, P16_7_TCPWM1_LINE65},
    {4u, 61u, P17_0, P17_0_TCPWM1_LINE61},
    {4u, 60u, P17_1, P17_1_TCPWM1_LINE60},
    {4u, 59u, P17_2, P17_2_TCPWM1_LINE59},
    {4u, 58u, P17_3, P17_3_TCPWM1_LINE58},
    {6u, 3u, P17_3, P17_3_TCPWM1_LINE515},
    {4u, 57u, P17_4, P17_4_TCPWM1_LINE57},
    {4u, 56u, P17_5, P17_5_TCPWM1_LINE56},
    {6u, 2u, P17_5, P17_5_TCPWM1_LINE514},
    {5u, 4u, P17_6, P17_6_TCPWM1_LINE260},
    {5u, 5u, P17_7, P17_7_TCPWM1_LINE261},
    {5u, 6u, P18_0, P18_0_TCPWM1_LINE262},
    {6u, 0u, P18_0, P18_0_TCPWM1_LINE512},
    {5u, 7u, P18_1, P18_1_TCPWM1_LINE263},
    {4u, 55u, P18_2, P18_2_TCPWM1_LINE55},
    {6u, 1u, P18_2, P18_2_TCPWM1_LINE513},
    {4u, 54u, P18_3, P18_3_TCPWM1_LINE54},
    {1u, 2u, P18_4, P18_4_TCPWM0_LINE258},
    {4u, 53u, P18_4, P18_4_TCPWM1_LINE53},
    {6u, 2u, P18_4, P18_4_TCPWM1_LINE514},
    {4u, 52u, P18_5, P18_5_TCPWM1_LINE52},
    {4u, 51u, P18_6, P18_6_TCPWM1_LINE51},
    {6u, 3u, P18_6, P18_6_TCPWM1_LINE515},
    {4u, 50u, P18_7, P18_7_TCPWM1_LINE50},
    {5u, 3u, P19_0, P19_0_TCPWM1_LINE259},
    {4u, 26u, P19_1, P19_1_TCPWM1_LINE26},
    {4u, 27u, P19_2, P19_2_TCPWM1_LINE27},
    {4u, 28u, P19_3, P19_3_TCPWM1_LINE28},
    {4u, 29u, P19_4, P19_4_TCPWM1_LINE29},
    {4u, 30u, P20_0, P20_0_TCPWM1_LINE30},
    {4u, 49u, P20_1, P20_1_TCPWM1_LINE49},
    {4u, 48u, P20_2, P20_2_TCPWM1_LINE48},
    {4u, 47u, P20_3, P20_3_TCPWM1_LINE47},
    {4u, 46u, P20_4, P20_4_TCPWM1_LINE46},
    {4u, 45u, P20_5, P20_5_TCPWM1_LINE45},
    {4u, 44u, P20_6, P20_6_TCPWM1_LINE44},
    {4u, 43u, P20_7, P20_7_TCPWM1_LINE43},
    {4u, 42u, P21_0, P21_0_TCPWM1_LINE42},
    {4u, 41u, P21_1, P21_1_TCPWM1_LINE41},
    {4u, 40u, P21_2, P21_2_TCPWM1_LINE40},
    {4u, 39u, P21_3, P21_3_TCPWM1_LINE39},
    {4u, 38u, P21_4, P21_4_TCPWM1_LINE38},
    {4u, 34u, P21_5, P21_5_TCPWM1_LINE34},
    {4u, 37u, P21_5, P21_5_TCPWM1_LINE37},
    {4u, 36u, P21_6, P21_6_TCPWM1_LINE36},
    {4u, 35u, P21_7, P21_7_TCPWM1_LINE35},
    {4u, 33u, P22_1, P22_1_TCPWM1_LINE33},
    {4u, 32u, P22_2, P22_2_TCPWM1_LINE32},
    {4u, 31u, P22_3, P22_3_TCPWM1_LINE31},
    {4u, 30u, P22_4, P22_4_TCPWM1_LINE30},
    {4u, 29u, P22_5, P22_5_TCPWM1_LINE29},
    {6u, 8u, P22_5, P22_5_TCPWM1_LINE520},
    {4u, 28u, P22_6, P22_6_TCPWM1_LINE28},
    {4u, 27u, P22_7, P22_7_TCPWM1_LINE27},
    {5u, 8u, P23_0, P23_0_TCPWM1_LINE264},
    {5u, 9u, P23_1, P23_1_TCPWM1_LINE265},
    {5u, 10u, P23_2, P23_2_TCPWM1_LINE266},
    {5u, 11u, P23_3, P23_3_TCPWM1_LINE267},
    {4u, 25u, P23_4, P23_4_TCPWM1_LINE25},
    {6u, 9u, P23_4, P23_4_TCPWM1_LINE521},
    {4u, 24u, P23_5, P23_5_TCPWM1_LINE24},
    {4u, 23u, P23_6, P23_6_TCPWM1_LINE23},
    {4u, 22u, P23_7, P23_7_TCPWM1_LINE22},
    {4u, 63u, P28_0, P28_0_TCPWM1_LINE63},
    {6u, 12u, P28_0, P28_0_TCPWM1_LINE524},
    {4u, 64u, P28_1, P28_1_TCPWM1_LINE64},
    {4u, 65u, P28_2, P28_2_TCPWM1_LINE65},
    {4u, 66u, P28_3, P28_3_TCPWM1_LINE66},
    {4u, 67u, P28_4, P28_4_TCPWM1_LINE67},
    {4u, 68u, P28_5, P28_5_TCPWM1_LINE68},
    {4u, 69u, P28_6, P28_6_TCPWM1_LINE69},
    {4u, 70u, P28_7, P28_7_TCPWM1_LINE70},
    {4u, 76u, P29_0, P29_0_TCPWM1_LINE76},
    {4u, 77u, P29_1, P29_1_TCPWM1_LINE77},
    {4u, 78u, P29_2, P29_2_TCPWM1_LINE78},
    {4u, 79u, P29_3, P29_3_TCPWM1_LINE79},
    {4u, 80u, P29_4, P29_4_TCPWM1_LINE80},
    {4u, 81u, P29_5, P29_5_TCPWM1_LINE81},
    {4u, 82u, P29_6, P29_6_TCPWM1_LINE82},
    {4u, 83u, P29_7, P29_7_TCPWM1_LINE83},
    {4u, 83u, P30_0, P30_0_TCPWM1_LINE83},
    {4u, 82u, P30_1, P30_1_TCPWM1_LINE82},
    {4u, 81u, P30_2, P30_2_TCPWM1_LINE81},
    {4u, 80u, P30_3, P30_3_TCPWM1_LINE80},
    {4u, 79u, P31_0, P31_0_TCPWM1_LINE79},
    {4u, 78u, P31_1, P31_1_TCPWM1_LINE78},
    {4u, 77u, P31_2, P31_2_TCPWM1_LINE77},
    {4u, 76u, P32_0, P32_0_TCPWM1_LINE76},
    {4u, 75u, P32_1, P32_1_TCPWM1_LINE75},
    {4u, 74u, P32_2, P32_2_TCPWM1_LINE74},
    {4u, 73u, P32_3, P32_3_TCPWM1_LINE73},
    {4u, 72u, P32_4, P32_4_TCPWM1_LINE72},
    {4u, 71u, P32_5, P32_5_TCPWM1_LINE71},
    {4u, 70u, P32_6, P32_6_TCPWM1_LINE70},
    {4u, 69u, P32_7, P32_7_TCPWM1_LINE69},
};

/* Connections for: tcpwm_line_compl */
const cyhal_resource_pin_mapping_t cyhal_pin_map_tcpwm_line_compl[227] = {
    {4u, 22u, P0_0, P0_0_TCPWM1_LINE_COMPL22},
    {2u, 0u, P0_1, P0_1_TCPWM0_LINE_COMPL512},
    {4u, 18u, P0_1, P0_1_TCPWM1_LINE_COMPL18},
    {4u, 17u, P0_2, P0_2_TCPWM1_LINE_COMPL17},
    {4u, 14u, P0_3, P0_3_TCPWM1_LINE_COMPL14},
    {4u, 13u, P1_0, P1_0_TCPWM1_LINE_COMPL13},
    {4u, 12u, P1_1, P1_1_TCPWM1_LINE_COMPL12},
    {4u, 11u, P1_2, P1_2_TCPWM1_LINE_COMPL11},
    {4u, 10u, P1_3, P1_3_TCPWM1_LINE_COMPL10},
    {4u, 70u, P1_4, P1_4_TCPWM1_LINE_COMPL70},
    {4u, 8u, P2_0, P2_0_TCPWM1_LINE_COMPL8},
    {4u, 7u, P2_1, P2_1_TCPWM1_LINE_COMPL7},
    {4u, 6u, P2_2, P2_2_TCPWM1_LINE_COMPL6},
    {4u, 5u, P2_3, P2_3_TCPWM1_LINE_COMPL5},
    {4u, 4u, P2_4, P2_4_TCPWM1_LINE_COMPL4},
    {6u, 4u, P2_4, P2_4_TCPWM1_LINE_COMPL516},
    {4u, 3u, P2_5, P2_5_TCPWM1_LINE_COMPL3},
    {6u, 5u, P2_5, P2_5_TCPWM1_LINE_COMPL517},
    {4u, 71u, P2_6, P2_6_TCPWM1_LINE_COMPL71},
    {4u, 72u, P2_7, P2_7_TCPWM1_LINE_COMPL72},
    {4u, 2u, P3_0, P3_0_TCPWM1_LINE_COMPL2},
    {6u, 6u, P3_0, P3_0_TCPWM1_LINE_COMPL518},
    {4u, 1u, P3_1, P3_1_TCPWM1_LINE_COMPL1},
    {6u, 7u, P3_1, P3_1_TCPWM1_LINE_COMPL519},
    {4u, 0u, P3_2, P3_2_TCPWM1_LINE_COMPL0},
    {5u, 3u, P3_3, P3_3_TCPWM1_LINE_COMPL259},
    {5u, 2u, P3_4, P3_4_TCPWM1_LINE_COMPL258},
    {5u, 1u, P3_5, P3_5_TCPWM1_LINE_COMPL257},
    {4u, 73u, P3_6, P3_6_TCPWM1_LINE_COMPL73},
    {4u, 74u, P3_7, P3_7_TCPWM1_LINE_COMPL74},
    {5u, 0u, P4_0, P4_0_TCPWM1_LINE_COMPL256},
    {4u, 4u, P4_1, P4_1_TCPWM1_LINE_COMPL4},
    {4u, 5u, P4_2, P4_2_TCPWM1_LINE_COMPL5},
    {4u, 6u, P4_3, P4_3_TCPWM1_LINE_COMPL6},
    {4u, 7u, P4_4, P4_4_TCPWM1_LINE_COMPL7},
    {4u, 8u, P5_0, P5_0_TCPWM1_LINE_COMPL8},
    {1u, 0u, P5_1, P5_1_TCPWM0_LINE_COMPL256},
    {4u, 9u, P5_1, P5_1_TCPWM1_LINE_COMPL9},
    {6u, 10u, P5_1, P5_1_TCPWM1_LINE_COMPL522},
    {4u, 10u, P5_2, P5_2_TCPWM1_LINE_COMPL10},
    {4u, 11u, P5_3, P5_3_TCPWM1_LINE_COMPL11},
    {4u, 12u, P5_4, P5_4_TCPWM1_LINE_COMPL12},
    {4u, 13u, P5_5, P5_5_TCPWM1_LINE_COMPL13},
    {6u, 11u, P5_5, P5_5_TCPWM1_LINE_COMPL523},
    {4u, 14u, P6_0, P6_0_TCPWM1_LINE_COMPL14},
    {5u, 0u, P6_1, P6_1_TCPWM1_LINE_COMPL256},
    {0u, 0u, P6_2, P6_2_TCPWM0_LINE_COMPL0},
    {4u, 0u, P6_2, P6_2_TCPWM1_LINE_COMPL0},
    {5u, 1u, P6_3, P6_3_TCPWM1_LINE_COMPL257},
    {6u, 12u, P6_3, P6_3_TCPWM1_LINE_COMPL524},
    {4u, 1u, P6_4, P6_4_TCPWM1_LINE_COMPL1},
    {5u, 2u, P6_5, P6_5_TCPWM1_LINE_COMPL258},
    {4u, 2u, P6_6, P6_6_TCPWM1_LINE_COMPL2},
    {5u, 3u, P6_7, P6_7_TCPWM1_LINE_COMPL259},
    {4u, 3u, P7_0, P7_0_TCPWM1_LINE_COMPL3},
    {5u, 4u, P7_1, P7_1_TCPWM1_LINE_COMPL260},
    {0u, 1u, P7_2, P7_2_TCPWM0_LINE_COMPL1},
    {4u, 15u, P7_2, P7_2_TCPWM1_LINE_COMPL15},
    {5u, 5u, P7_3, P7_3_TCPWM1_LINE_COMPL261},
    {4u, 16u, P7_4, P7_4_TCPWM1_LINE_COMPL16},
    {5u, 6u, P7_5, P7_5_TCPWM1_LINE_COMPL262},
    {4u, 17u, P7_6, P7_6_TCPWM1_LINE_COMPL17},
    {5u, 7u, P7_7, P7_7_TCPWM1_LINE_COMPL263},
    {2u, 2u, P8_0, P8_0_TCPWM0_LINE_COMPL514},
    {4u, 18u, P8_0, P8_0_TCPWM1_LINE_COMPL18},
    {4u, 19u, P8_1, P8_1_TCPWM1_LINE_COMPL19},
    {6u, 8u, P8_1, P8_1_TCPWM1_LINE_COMPL520},
    {4u, 20u, P8_2, P8_2_TCPWM1_LINE_COMPL20},
    {4u, 21u, P8_3, P8_3_TCPWM1_LINE_COMPL21},
    {4u, 22u, P8_4, P8_4_TCPWM1_LINE_COMPL22},
    {4u, 23u, P9_0, P9_0_TCPWM1_LINE_COMPL23},
    {4u, 24u, P9_1, P9_1_TCPWM1_LINE_COMPL24},
    {6u, 9u, P9_1, P9_1_TCPWM1_LINE_COMPL521},
    {4u, 25u, P9_2, P9_2_TCPWM1_LINE_COMPL25},
    {4u, 26u, P9_3, P9_3_TCPWM1_LINE_COMPL26},
    {4u, 27u, P10_0, P10_0_TCPWM1_LINE_COMPL27},
    {4u, 28u, P10_1, P10_1_TCPWM1_LINE_COMPL28},
    {6u, 10u, P10_1, P10_1_TCPWM1_LINE_COMPL522},
    {4u, 29u, P10_2, P10_2_TCPWM1_LINE_COMPL29},
    {4u, 30u, P10_3, P10_3_TCPWM1_LINE_COMPL30},
    {4u, 31u, P10_4, P10_4_TCPWM1_LINE_COMPL31},
    {4u, 32u, P10_5, P10_5_TCPWM1_LINE_COMPL32},
    {6u, 11u, P10_5, P10_5_TCPWM1_LINE_COMPL523},
    {4u, 33u, P10_6, P10_6_TCPWM1_LINE_COMPL33},
    {4u, 34u, P10_7, P10_7_TCPWM1_LINE_COMPL34},
    {4u, 62u, P11_0, P11_0_TCPWM1_LINE_COMPL62},
    {4u, 61u, P11_1, P11_1_TCPWM1_LINE_COMPL61},
    {4u, 60u, P11_2, P11_2_TCPWM1_LINE_COMPL60},
    {4u, 35u, P12_0, P12_0_TCPWM1_LINE_COMPL35},
    {2u, 1u, P12_1, P12_1_TCPWM0_LINE_COMPL513},
    {4u, 36u, P12_1, P12_1_TCPWM1_LINE_COMPL36},
    {4u, 37u, P12_2, P12_2_TCPWM1_LINE_COMPL37},
    {4u, 38u, P12_3, P12_3_TCPWM1_LINE_COMPL38},
    {4u, 39u, P12_4, P12_4_TCPWM1_LINE_COMPL39},
    {4u, 40u, P12_5, P12_5_TCPWM1_LINE_COMPL40},
    {4u, 41u, P12_6, P12_6_TCPWM1_LINE_COMPL41},
    {4u, 42u, P12_7, P12_7_TCPWM1_LINE_COMPL42},
    {4u, 43u, P13_0, P13_0_TCPWM1_LINE_COMPL43},
    {0u, 2u, P13_1, P13_1_TCPWM0_LINE_COMPL2},
    {5u, 8u, P13_1, P13_1_TCPWM1_LINE_COMPL264},
    {4u, 44u, P13_2, P13_2_TCPWM1_LINE_COMPL44},
    {5u, 9u, P13_3, P13_3_TCPWM1_LINE_COMPL265},
    {4u, 45u, P13_4, P13_4_TCPWM1_LINE_COMPL45},
    {5u, 10u, P13_5, P13_5_TCPWM1_LINE_COMPL266},
    {6u, 4u, P13_5, P13_5_TCPWM1_LINE_COMPL516},
    {4u, 46u, P13_6, P13_6_TCPWM1_LINE_COMPL46},
    {5u, 11u, P13_7, P13_7_TCPWM1_LINE_COMPL267},
    {6u, 5u, P13_7, P13_7_TCPWM1_LINE_COMPL517},
    {4u, 47u, P14_0, P14_0_TCPWM1_LINE_COMPL47},
    {1u, 1u, P14_1, P14_1_TCPWM0_LINE_COMPL257},
    {4u, 48u, P14_1, P14_1_TCPWM1_LINE_COMPL48},
    {6u, 6u, P14_1, P14_1_TCPWM1_LINE_COMPL518},
    {4u, 49u, P14_2, P14_2_TCPWM1_LINE_COMPL49},
    {4u, 50u, P14_3, P14_3_TCPWM1_LINE_COMPL50},
    {6u, 7u, P14_3, P14_3_TCPWM1_LINE_COMPL519},
    {4u, 51u, P14_4, P14_4_TCPWM1_LINE_COMPL51},
    {4u, 52u, P14_5, P14_5_TCPWM1_LINE_COMPL52},
    {4u, 53u, P14_6, P14_6_TCPWM1_LINE_COMPL53},
    {4u, 54u, P14_7, P14_7_TCPWM1_LINE_COMPL54},
    {4u, 55u, P15_0, P15_0_TCPWM1_LINE_COMPL55},
    {4u, 56u, P15_1, P15_1_TCPWM1_LINE_COMPL56},
    {4u, 57u, P15_2, P15_2_TCPWM1_LINE_COMPL57},
    {4u, 58u, P15_3, P15_3_TCPWM1_LINE_COMPL58},
    {4u, 59u, P16_0, P16_0_TCPWM1_LINE_COMPL59},
    {4u, 60u, P16_1, P16_1_TCPWM1_LINE_COMPL60},
    {6u, 0u, P16_1, P16_1_TCPWM1_LINE_COMPL512},
    {4u, 61u, P16_2, P16_2_TCPWM1_LINE_COMPL61},
    {4u, 62u, P16_3, P16_3_TCPWM1_LINE_COMPL62},
    {6u, 1u, P16_3, P16_3_TCPWM1_LINE_COMPL513},
    {4u, 69u, P16_4, P16_4_TCPWM1_LINE_COMPL69},
    {4u, 68u, P16_5, P16_5_TCPWM1_LINE_COMPL68},
    {4u, 67u, P16_6, P16_6_TCPWM1_LINE_COMPL67},
    {4u, 66u, P16_7, P16_7_TCPWM1_LINE_COMPL66},
    {4u, 62u, P17_0, P17_0_TCPWM1_LINE_COMPL62},
    {4u, 61u, P17_1, P17_1_TCPWM1_LINE_COMPL61},
    {4u, 60u, P17_2, P17_2_TCPWM1_LINE_COMPL60},
    {4u, 59u, P17_3, P17_3_TCPWM1_LINE_COMPL59},
    {4u, 58u, P17_4, P17_4_TCPWM1_LINE_COMPL58},
    {6u, 3u, P17_4, P17_4_TCPWM1_LINE_COMPL515},
    {4u, 57u, P17_5, P17_5_TCPWM1_LINE_COMPL57},
    {4u, 56u, P17_6, P17_6_TCPWM1_LINE_COMPL56},
    {6u, 2u, P17_6, P17_6_TCPWM1_LINE_COMPL514},
    {5u, 4u, P17_7, P17_7_TCPWM1_LINE_COMPL260},
    {5u, 5u, P18_0, P18_0_TCPWM1_LINE_COMPL261},
    {5u, 6u, P18_1, P18_1_TCPWM1_LINE_COMPL262},
    {6u, 0u, P18_1, P18_1_TCPWM1_LINE_COMPL512},
    {5u, 7u, P18_2, P18_2_TCPWM1_LINE_COMPL263},
    {4u, 55u, P18_3, P18_3_TCPWM1_LINE_COMPL55},
    {6u, 1u, P18_3, P18_3_TCPWM1_LINE_COMPL513},
    {4u, 54u, P18_4, P18_4_TCPWM1_LINE_COMPL54},
    {1u, 2u, P18_5, P18_5_TCPWM0_LINE_COMPL258},
    {4u, 53u, P18_5, P18_5_TCPWM1_LINE_COMPL53},
    {6u, 2u, P18_5, P18_5_TCPWM1_LINE_COMPL514},
    {4u, 52u, P18_6, P18_6_TCPWM1_LINE_COMPL52},
    {4u, 51u, P18_7, P18_7_TCPWM1_LINE_COMPL51},
    {6u, 3u, P18_7, P18_7_TCPWM1_LINE_COMPL515},
    {4u, 50u, P19_0, P19_0_TCPWM1_LINE_COMPL50},
    {5u, 3u, P19_1, P19_1_TCPWM1_LINE_COMPL259},
    {4u, 26u, P19_2, P19_2_TCPWM1_LINE_COMPL26},
    {4u, 27u, P19_3, P19_3_TCPWM1_LINE_COMPL27},
    {4u, 28u, P19_4, P19_4_TCPWM1_LINE_COMPL28},
    {4u, 29u, P20_0, P20_0_TCPWM1_LINE_COMPL29},
    {4u, 30u, P20_1, P20_1_TCPWM1_LINE_COMPL30},
    {4u, 49u, P20_2, P20_2_TCPWM1_LINE_COMPL49},
    {4u, 48u, P20_3, P20_3_TCPWM1_LINE_COMPL48},
    {4u, 47u, P20_4, P20_4_TCPWM1_LINE_COMPL47},
    {4u, 46u, P20_5, P20_5_TCPWM1_LINE_COMPL46},
    {4u, 45u, P20_6, P20_6_TCPWM1_LINE_COMPL45},
    {4u, 44u, P20_7, P20_7_TCPWM1_LINE_COMPL44},
    {4u, 43u, P21_0, P21_0_TCPWM1_LINE_COMPL43},
    {4u, 42u, P21_1, P21_1_TCPWM1_LINE_COMPL42},
    {4u, 41u, P21_2, P21_2_TCPWM1_LINE_COMPL41},
    {4u, 40u, P21_3, P21_3_TCPWM1_LINE_COMPL40},
    {4u, 39u, P21_4, P21_4_TCPWM1_LINE_COMPL39},
    {4u, 35u, P21_5, P21_5_TCPWM1_LINE_COMPL35},
    {4u, 38u, P21_5, P21_5_TCPWM1_LINE_COMPL38},
    {4u, 37u, P21_6, P21_6_TCPWM1_LINE_COMPL37},
    {4u, 36u, P21_7, P21_7_TCPWM1_LINE_COMPL36},
    {4u, 34u, P22_1, P22_1_TCPWM1_LINE_COMPL34},
    {4u, 33u, P22_2, P22_2_TCPWM1_LINE_COMPL33},
    {4u, 32u, P22_3, P22_3_TCPWM1_LINE_COMPL32},
    {4u, 31u, P22_4, P22_4_TCPWM1_LINE_COMPL31},
    {4u, 30u, P22_5, P22_5_TCPWM1_LINE_COMPL30},
    {4u, 29u, P22_6, P22_6_TCPWM1_LINE_COMPL29},
    {6u, 8u, P22_6, P22_6_TCPWM1_LINE_COMPL520},
    {4u, 28u, P22_7, P22_7_TCPWM1_LINE_COMPL28},
    {4u, 27u, P23_0, P23_0_TCPWM1_LINE_COMPL27},
    {5u, 8u, P23_1, P23_1_TCPWM1_LINE_COMPL264},
    {5u, 9u, P23_2, P23_2_TCPWM1_LINE_COMPL265},
    {5u, 10u, P23_3, P23_3_TCPWM1_LINE_COMPL266},
    {5u, 11u, P23_4, P23_4_TCPWM1_LINE_COMPL267},
    {4u, 25u, P23_5, P23_5_TCPWM1_LINE_COMPL25},
    {6u, 9u, P23_5, P23_5_TCPWM1_LINE_COMPL521},
    {4u, 24u, P23_6, P23_6_TCPWM1_LINE_COMPL24},
    {4u, 23u, P23_7, P23_7_TCPWM1_LINE_COMPL23},
    {4u, 65u, P28_0, P28_0_TCPWM1_LINE_COMPL65},
    {4u, 63u, P28_1, P28_1_TCPWM1_LINE_COMPL63},
    {6u, 12u, P28_1, P28_1_TCPWM1_LINE_COMPL524},
    {4u, 64u, P28_2, P28_2_TCPWM1_LINE_COMPL64},
    {4u, 65u, P28_3, P28_3_TCPWM1_LINE_COMPL65},
    {4u, 66u, P28_4, P28_4_TCPWM1_LINE_COMPL66},
    {4u, 67u, P28_5, P28_5_TCPWM1_LINE_COMPL67},
    {4u, 68u, P28_6, P28_6_TCPWM1_LINE_COMPL68},
    {4u, 69u, P28_7, P28_7_TCPWM1_LINE_COMPL69},
    {4u, 75u, P29_0, P29_0_TCPWM1_LINE_COMPL75},
    {4u, 76u, P29_1, P29_1_TCPWM1_LINE_COMPL76},
    {4u, 77u, P29_2, P29_2_TCPWM1_LINE_COMPL77},
    {4u, 78u, P29_3, P29_3_TCPWM1_LINE_COMPL78},
    {4u, 79u, P29_4, P29_4_TCPWM1_LINE_COMPL79},
    {4u, 80u, P29_5, P29_5_TCPWM1_LINE_COMPL80},
    {4u, 81u, P29_6, P29_6_TCPWM1_LINE_COMPL81},
    {4u, 82u, P29_7, P29_7_TCPWM1_LINE_COMPL82},
    {4u, 83u, P30_0, P30_0_TCPWM1_LINE_COMPL83},
    {4u, 83u, P30_1, P30_1_TCPWM1_LINE_COMPL83},
    {4u, 82u, P30_2, P30_2_TCPWM1_LINE_COMPL82},
    {4u, 81u, P30_3, P30_3_TCPWM1_LINE_COMPL81},
    {4u, 80u, P31_0, P31_0_TCPWM1_LINE_COMPL80},
    {4u, 79u, P31_1, P31_1_TCPWM1_LINE_COMPL79},
    {4u, 78u, P31_2, P31_2_TCPWM1_LINE_COMPL78},
    {4u, 77u, P32_0, P32_0_TCPWM1_LINE_COMPL77},
    {4u, 76u, P32_1, P32_1_TCPWM1_LINE_COMPL76},
    {4u, 75u, P32_2, P32_2_TCPWM1_LINE_COMPL75},
    {4u, 74u, P32_3, P32_3_TCPWM1_LINE_COMPL74},
    {4u, 73u, P32_4, P32_4_TCPWM1_LINE_COMPL73},
    {4u, 72u, P32_5, P32_5_TCPWM1_LINE_COMPL72},
    {4u, 71u, P32_6, P32_6_TCPWM1_LINE_COMPL71},
    {4u, 70u, P32_7, P32_7_TCPWM1_LINE_COMPL70},
};

