RT-Thread/rt-thread/bsp/Infineon/libraries/IFX_PSOC6_HAL/mtb-hal-cat1/COMPONENT_CAT1C/source/pin_packages/cyhal_xmc7200_272_bga.c
/* Connections for: tcpwm_tr_one_cnt_in */
const cyhal_resource_pin_mapping_t cyhal_pin_map_tcpwm_tr_one_cnt_in[446] = {
    {4u, 54u, P0_0, P0_0_TCPWM1_TR_ONE_CNT_IN54},
    {4u, 67u, P0_0, P0_0_TCPWM1_TR_ONE_CNT_IN67},
    {4u, 51u, P0_1, P0_1_TCPWM1_TR_ONE_CNT_IN51},
    {4u, 55u, P0_1, P0_1_TCPWM1_TR_ONE_CNT_IN55},
    {4u, 42u, P0_2, P0_2_TCPWM1_TR_ONE_CNT_IN42},
    {4u, 52u, P0_2, P0_2_TCPWM1_TR_ONE_CNT_IN52},
    {6u, 0u, P0_2, P0_2_TCPWM0_TR_ONE_CNT_IN1536},
    {4u, 39u, P0_3, P0_3_TCPWM1_TR_ONE_CNT_IN39},
    {4u, 43u, P0_3, P0_3_TCPWM1_TR_ONE_CNT_IN43},
    {6u, 1u, P0_3, P0_3_TCPWM0_TR_ONE_CNT_IN1537},
    {4u, 36u, P1_0, P1_0_TCPWM1_TR_ONE_CNT_IN36},
    {4u, 40u, P1_0, P1_0_TCPWM1_TR_ONE_CNT_IN40},
    {4u, 33u, P1_1, P1_1_TCPWM1_TR_ONE_CNT_IN33},
    {4u, 37u, P1_1, P1_1_TCPWM1_TR_ONE_CNT_IN37},
    {4u, 30u, P1_2, P1_2_TCPWM1_TR_ONE_CNT_IN30},
    {4u, 34u, P1_2, P1_2_TCPWM1_TR_ONE_CNT_IN34},
    {4u, 24u, P1_3, P1_3_TCPWM1_TR_ONE_CNT_IN24},
    {4u, 31u, P1_3, P1_3_TCPWM1_TR_ONE_CNT_IN31},
    {4u, 211u, P1_4, P1_4_TCPWM1_TR_ONE_CNT_IN211},
    {4u, 213u, P1_4, P1_4_TCPWM1_TR_ONE_CNT_IN213},
    {4u, 21u, P2_0, P2_0_TCPWM1_TR_ONE_CNT_IN21},
    {4u, 25u, P2_0, P2_0_TCPWM1_TR_ONE_CNT_IN25},
    {10u, 12u, P2_0, P2_0_TCPWM1_TR_ONE_CNT_IN1548},
    {4u, 18u, P2_1, P2_1_TCPWM1_TR_ONE_CNT_IN18},
    {4u, 22u, P2_1, P2_1_TCPWM1_TR_ONE_CNT_IN22},
    {10u, 15u, P2_1, P2_1_TCPWM1_TR_ONE_CNT_IN1551},
    {4u, 15u, P2_2, P2_2_TCPWM1_TR_ONE_CNT_IN15},
    {4u, 19u, P2_2, P2_2_TCPWM1_TR_ONE_CNT_IN19},
    {10u, 18u, P2_2, P2_2_TCPWM1_TR_ONE_CNT_IN1554},
    {4u, 12u, P2_3, P2_3_TCPWM1_TR_ONE_CNT_IN12},
    {4u, 16u, P2_3, P2_3_TCPWM1_TR_ONE_CNT_IN16},
    {10u, 21u, P2_3, P2_3_TCPWM1_TR_ONE_CNT_IN1557},
    {4u, 9u, P2_4, P2_4_TCPWM1_TR_ONE_CNT_IN9},
    {4u, 13u, P2_4, P2_4_TCPWM1_TR_ONE_CNT_IN13},
    {4u, 6u, P2_5, P2_5_TCPWM1_TR_ONE_CNT_IN6},
    {4u, 10u, P2_5, P2_5_TCPWM1_TR_ONE_CNT_IN10},
    {4u, 214u, P2_6, P2_6_TCPWM1_TR_ONE_CNT_IN214},
    {4u, 216u, P2_6, P2_6_TCPWM1_TR_ONE_CNT_IN216},
    {4u, 217u, P2_7, P2_7_TCPWM1_TR_ONE_CNT_IN217},
    {4u, 219u, P2_7, P2_7_TCPWM1_TR_ONE_CNT_IN219},
    {4u, 3u, P3_0, P3_0_TCPWM1_TR_ONE_CNT_IN3},
    {4u, 7u, P3_0, P3_0_TCPWM1_TR_ONE_CNT_IN7},
    {4u, 0u, P3_1, P3_1_TCPWM1_TR_ONE_CNT_IN0},
    {4u, 4u, P3_1, P3_1_TCPWM1_TR_ONE_CNT_IN4},
    {4u, 1u, P3_2, P3_2_TCPWM1_TR_ONE_CNT_IN1},
    {7u, 9u, P3_2, P3_2_TCPWM1_TR_ONE_CNT_IN777},
    {10u, 13u, P3_2, P3_2_TCPWM1_TR_ONE_CNT_IN1549},
    {7u, 6u, P3_3, P3_3_TCPWM1_TR_ONE_CNT_IN774},
    {7u, 10u, P3_3, P3_3_TCPWM1_TR_ONE_CNT_IN778},
    {10u, 16u, P3_3, P3_3_TCPWM1_TR_ONE_CNT_IN1552},
    {7u, 3u, P3_4, P3_4_TCPWM1_TR_ONE_CNT_IN771},
    {7u, 7u, P3_4, P3_4_TCPWM1_TR_ONE_CNT_IN775},
    {10u, 19u, P3_4, P3_4_TCPWM1_TR_ONE_CNT_IN1555},
    {7u, 0u, P3_5, P3_5_TCPWM1_TR_ONE_CNT_IN768},
    {7u, 4u, P3_5, P3_5_TCPWM1_TR_ONE_CNT_IN772},
    {10u, 22u, P3_5, P3_5_TCPWM1_TR_ONE_CNT_IN1558},
    {4u, 220u, P3_6, P3_6_TCPWM1_TR_ONE_CNT_IN220},
    {4u, 222u, P3_6, P3_6_TCPWM1_TR_ONE_CNT_IN222},
    {4u, 223u, P3_7, P3_7_TCPWM1_TR_ONE_CNT_IN223},
    {4u, 225u, P3_7, P3_7_TCPWM1_TR_ONE_CNT_IN225},
    {4u, 12u, P4_0, P4_0_TCPWM1_TR_ONE_CNT_IN12},
    {7u, 1u, P4_0, P4_0_TCPWM1_TR_ONE_CNT_IN769},
    {4u, 13u, P4_1, P4_1_TCPWM1_TR_ONE_CNT_IN13},
    {4u, 15u, P4_1, P4_1_TCPWM1_TR_ONE_CNT_IN15},
    {4u, 16u, P4_2, P4_2_TCPWM1_TR_ONE_CNT_IN16},
    {4u, 18u, P4_2, P4_2_TCPWM1_TR_ONE_CNT_IN18},
    {4u, 19u, P4_3, P4_3_TCPWM1_TR_ONE_CNT_IN19},
    {4u, 21u, P4_3, P4_3_TCPWM1_TR_ONE_CNT_IN21},
    {4u, 22u, P4_4, P4_4_TCPWM1_TR_ONE_CNT_IN22},
    {4u, 24u, P4_4, P4_4_TCPWM1_TR_ONE_CNT_IN24},
    {4u, 25u, P5_0, P5_0_TCPWM1_TR_ONE_CNT_IN25},
    {4u, 27u, P5_0, P5_0_TCPWM1_TR_ONE_CNT_IN27},
    {4u, 28u, P5_1, P5_1_TCPWM1_TR_ONE_CNT_IN28},
    {4u, 30u, P5_1, P5_1_TCPWM1_TR_ONE_CNT_IN30},
    {3u, 0u, P5_2, P5_2_TCPWM0_TR_ONE_CNT_IN768},
    {4u, 31u, P5_2, P5_2_TCPWM1_TR_ONE_CNT_IN31},
    {4u, 33u, P5_2, P5_2_TCPWM1_TR_ONE_CNT_IN33},
    {10u, 30u, P5_2, P5_2_TCPWM1_TR_ONE_CNT_IN1566},
    {3u, 1u, P5_3, P5_3_TCPWM0_TR_ONE_CNT_IN769},
    {4u, 34u, P5_3, P5_3_TCPWM1_TR_ONE_CNT_IN34},
    {4u, 36u, P5_3, P5_3_TCPWM1_TR_ONE_CNT_IN36},
    {10u, 31u, P5_3, P5_3_TCPWM1_TR_ONE_CNT_IN1567},
    {4u, 37u, P5_4, P5_4_TCPWM1_TR_ONE_CNT_IN37},
    {4u, 39u, P5_4, P5_4_TCPWM1_TR_ONE_CNT_IN39},
    {4u, 40u, P5_5, P5_5_TCPWM1_TR_ONE_CNT_IN40},
    {4u, 42u, P5_5, P5_5_TCPWM1_TR_ONE_CNT_IN42},
    {4u, 43u, P6_0, P6_0_TCPWM1_TR_ONE_CNT_IN43},
    {7u, 0u, P6_0, P6_0_TCPWM1_TR_ONE_CNT_IN768},
    {10u, 33u, P6_0, P6_0_TCPWM1_TR_ONE_CNT_IN1569},
    {4u, 0u, P6_1, P6_1_TCPWM1_TR_ONE_CNT_IN0},
    {7u, 1u, P6_1, P6_1_TCPWM1_TR_ONE_CNT_IN769},
    {10u, 34u, P6_1, P6_1_TCPWM1_TR_ONE_CNT_IN1570},
    {4u, 1u, P6_2, P6_2_TCPWM1_TR_ONE_CNT_IN1},
    {7u, 3u, P6_2, P6_2_TCPWM1_TR_ONE_CNT_IN771},
    {4u, 3u, P6_3, P6_3_TCPWM1_TR_ONE_CNT_IN3},
    {7u, 4u, P6_3, P6_3_TCPWM1_TR_ONE_CNT_IN772},
    {0u, 0u, P6_4, P6_4_TCPWM0_TR_ONE_CNT_IN0},
    {4u, 4u, P6_4, P6_4_TCPWM1_TR_ONE_CNT_IN4},
    {7u, 6u, P6_4, P6_4_TCPWM1_TR_ONE_CNT_IN774},
    {10u, 36u, P6_4, P6_4_TCPWM1_TR_ONE_CNT_IN1572},
    {0u, 1u, P6_5, P6_5_TCPWM0_TR_ONE_CNT_IN1},
    {4u, 6u, P6_5, P6_5_TCPWM1_TR_ONE_CNT_IN6},
    {7u, 7u, P6_5, P6_5_TCPWM1_TR_ONE_CNT_IN775},
    {10u, 37u, P6_5, P6_5_TCPWM1_TR_ONE_CNT_IN1573},
    {4u, 7u, P6_6, P6_6_TCPWM1_TR_ONE_CNT_IN7},
    {7u, 9u, P6_6, P6_6_TCPWM1_TR_ONE_CNT_IN777},
    {4u, 9u, P6_7, P6_7_TCPWM1_TR_ONE_CNT_IN9},
    {7u, 10u, P6_7, P6_7_TCPWM1_TR_ONE_CNT_IN778},
    {4u, 10u, P7_0, P7_0_TCPWM1_TR_ONE_CNT_IN10},
    {7u, 12u, P7_0, P7_0_TCPWM1_TR_ONE_CNT_IN780},
    {4u, 45u, P7_1, P7_1_TCPWM1_TR_ONE_CNT_IN45},
    {7u, 13u, P7_1, P7_1_TCPWM1_TR_ONE_CNT_IN781},
    {4u, 46u, P7_2, P7_2_TCPWM1_TR_ONE_CNT_IN46},
    {7u, 15u, P7_2, P7_2_TCPWM1_TR_ONE_CNT_IN783},
    {0u, 3u, P7_3, P7_3_TCPWM0_TR_ONE_CNT_IN3},
    {4u, 48u, P7_3, P7_3_TCPWM1_TR_ONE_CNT_IN48},
    {7u, 16u, P7_3, P7_3_TCPWM1_TR_ONE_CNT_IN784},
    {0u, 4u, P7_4, P7_4_TCPWM0_TR_ONE_CNT_IN4},
    {4u, 49u, P7_4, P7_4_TCPWM1_TR_ONE_CNT_IN49},
    {7u, 18u, P7_4, P7_4_TCPWM1_TR_ONE_CNT_IN786},
    {4u, 51u, P7_5, P7_5_TCPWM1_TR_ONE_CNT_IN51},
    {7u, 19u, P7_5, P7_5_TCPWM1_TR_ONE_CNT_IN787},
    {4u, 52u, P7_6, P7_6_TCPWM1_TR_ONE_CNT_IN52},
    {7u, 21u, P7_6, P7_6_TCPWM1_TR_ONE_CNT_IN789},
    {4u, 54u, P7_7, P7_7_TCPWM1_TR_ONE_CNT_IN54},
    {7u, 22u, P7_7, P7_7_TCPWM1_TR_ONE_CNT_IN790},
    {4u, 55u, P8_0, P8_0_TCPWM1_TR_ONE_CNT_IN55},
    {4u, 57u, P8_0, P8_0_TCPWM1_TR_ONE_CNT_IN57},
    {4u, 58u, P8_1, P8_1_TCPWM1_TR_ONE_CNT_IN58},
    {4u, 60u, P8_1, P8_1_TCPWM1_TR_ONE_CNT_IN60},
    {6u, 6u, P8_1, P8_1_TCPWM0_TR_ONE_CNT_IN1542},
    {4u, 61u, P8_2, P8_2_TCPWM1_TR_ONE_CNT_IN61},
    {4u, 63u, P8_2, P8_2_TCPWM1_TR_ONE_CNT_IN63},
    {6u, 7u, P8_2, P8_2_TCPWM0_TR_ONE_CNT_IN1543},
    {10u, 24u, P8_2, P8_2_TCPWM1_TR_ONE_CNT_IN1560},
    {4u, 64u, P8_3, P8_3_TCPWM1_TR_ONE_CNT_IN64},
    {4u, 66u, P8_3, P8_3_TCPWM1_TR_ONE_CNT_IN66},
    {10u, 25u, P8_3, P8_3_TCPWM1_TR_ONE_CNT_IN1561},
    {4u, 67u, P8_4, P8_4_TCPWM1_TR_ONE_CNT_IN67},
    {4u, 69u, P8_4, P8_4_TCPWM1_TR_ONE_CNT_IN69},
    {4u, 70u, P9_0, P9_0_TCPWM1_TR_ONE_CNT_IN70},
    {4u, 72u, P9_0, P9_0_TCPWM1_TR_ONE_CNT_IN72},
    {4u, 73u, P9_1, P9_1_TCPWM1_TR_ONE_CNT_IN73},
    {4u, 75u, P9_1, P9_1_TCPWM1_TR_ONE_CNT_IN75},
    {4u, 76u, P9_2, P9_2_TCPWM1_TR_ONE_CNT_IN76},
    {4u, 78u, P9_2, P9_2_TCPWM1_TR_ONE_CNT_IN78},
    {10u, 27u, P9_2, P9_2_TCPWM1_TR_ONE_CNT_IN1563},
    {4u, 79u, P9_3, P9_3_TCPWM1_TR_ONE_CNT_IN79},
    {4u, 81u, P9_3, P9_3_TCPWM1_TR_ONE_CNT_IN81},
    {10u, 28u, P9_3, P9_3_TCPWM1_TR_ONE_CNT_IN1564},
    {4u, 82u, P10_0, P10_0_TCPWM1_TR_ONE_CNT_IN82},
    {4u, 84u, P10_0, P10_0_TCPWM1_TR_ONE_CNT_IN84},
    {4u, 85u, P10_1, P10_1_TCPWM1_TR_ONE_CNT_IN85},
    {4u, 87u, P10_1, P10_1_TCPWM1_TR_ONE_CNT_IN87},
    {4u, 88u, P10_2, P10_2_TCPWM1_TR_ONE_CNT_IN88},
    {4u, 90u, P10_2, P10_2_TCPWM1_TR_ONE_CNT_IN90},
    {10u, 30u, P10_2, P10_2_TCPWM1_TR_ONE_CNT_IN1566},
    {4u, 91u, P10_3, P10_3_TCPWM1_TR_ONE_CNT_IN91},
    {4u, 93u, P10_3, P10_3_TCPWM1_TR_ONE_CNT_IN93},
    {10u, 31u, P10_3, P10_3_TCPWM1_TR_ONE_CNT_IN1567},
    {4u, 94u, P10_4, P10_4_TCPWM1_TR_ONE_CNT_IN94},
    {4u, 96u, P10_4, P10_4_TCPWM1_TR_ONE_CNT_IN96},
    {4u, 97u, P10_5, P10_5_TCPWM1_TR_ONE_CNT_IN97},
    {4u, 99u, P10_5, P10_5_TCPWM1_TR_ONE_CNT_IN99},
    {4u, 100u, P10_6, P10_6_TCPWM1_TR_ONE_CNT_IN100},
    {4u, 102u, P10_6, P10_6_TCPWM1_TR_ONE_CNT_IN102},
    {10u, 33u, P10_6, P10_6_TCPWM1_TR_ONE_CNT_IN1569},
    {4u, 103u, P10_7, P10_7_TCPWM1_TR_ONE_CNT_IN103},
    {4u, 105u, P10_7, P10_7_TCPWM1_TR_ONE_CNT_IN105},
    {10u, 34u, P10_7, P10_7_TCPWM1_TR_ONE_CNT_IN1570},
    {4u, 183u, P11_0, P11_0_TCPWM1_TR_ONE_CNT_IN183},
    {4u, 187u, P11_0, P11_0_TCPWM1_TR_ONE_CNT_IN187},
    {4u, 180u, P11_1, P11_1_TCPWM1_TR_ONE_CNT_IN180},
    {4u, 184u, P11_1, P11_1_TCPWM1_TR_ONE_CNT_IN184},
    {4u, 177u, P11_2, P11_2_TCPWM1_TR_ONE_CNT_IN177},
    {4u, 181u, P11_2, P11_2_TCPWM1_TR_ONE_CNT_IN181},
    {4u, 106u, P12_0, P12_0_TCPWM1_TR_ONE_CNT_IN106},
    {4u, 108u, P12_0, P12_0_TCPWM1_TR_ONE_CNT_IN108},
    {4u, 109u, P12_1, P12_1_TCPWM1_TR_ONE_CNT_IN109},
    {4u, 111u, P12_1, P12_1_TCPWM1_TR_ONE_CNT_IN111},
    {4u, 112u, P12_2, P12_2_TCPWM1_TR_ONE_CNT_IN112},
    {4u, 114u, P12_2, P12_2_TCPWM1_TR_ONE_CNT_IN114},
    {6u, 3u, P12_2, P12_2_TCPWM0_TR_ONE_CNT_IN1539},
    {4u, 115u, P12_3, P12_3_TCPWM1_TR_ONE_CNT_IN115},
    {4u, 117u, P12_3, P12_3_TCPWM1_TR_ONE_CNT_IN117},
    {6u, 4u, P12_3, P12_3_TCPWM0_TR_ONE_CNT_IN1540},
    {0u, 7u, P12_4, P12_4_TCPWM0_TR_ONE_CNT_IN7},
    {4u, 118u, P12_4, P12_4_TCPWM1_TR_ONE_CNT_IN118},
    {4u, 120u, P12_4, P12_4_TCPWM1_TR_ONE_CNT_IN120},
    {4u, 121u, P12_5, P12_5_TCPWM1_TR_ONE_CNT_IN121},
    {4u, 123u, P12_5, P12_5_TCPWM1_TR_ONE_CNT_IN123},
    {4u, 124u, P12_6, P12_6_TCPWM1_TR_ONE_CNT_IN124},
    {4u, 126u, P12_6, P12_6_TCPWM1_TR_ONE_CNT_IN126},
    {4u, 127u, P12_7, P12_7_TCPWM1_TR_ONE_CNT_IN127},
    {4u, 129u, P12_7, P12_7_TCPWM1_TR_ONE_CNT_IN129},
    {0u, 6u, P13_0, P13_0_TCPWM0_TR_ONE_CNT_IN6},
    {4u, 130u, P13_0, P13_0_TCPWM1_TR_ONE_CNT_IN130},
    {7u, 24u, P13_0, P13_0_TCPWM1_TR_ONE_CNT_IN792},
    {4u, 132u, P13_1, P13_1_TCPWM1_TR_ONE_CNT_IN132},
    {7u, 25u, P13_1, P13_1_TCPWM1_TR_ONE_CNT_IN793},
    {4u, 133u, P13_2, P13_2_TCPWM1_TR_ONE_CNT_IN133},
    {7u, 27u, P13_2, P13_2_TCPWM1_TR_ONE_CNT_IN795},
    {4u, 135u, P13_3, P13_3_TCPWM1_TR_ONE_CNT_IN135},
    {7u, 28u, P13_3, P13_3_TCPWM1_TR_ONE_CNT_IN796},
    {4u, 136u, P13_4, P13_4_TCPWM1_TR_ONE_CNT_IN136},
    {7u, 30u, P13_4, P13_4_TCPWM1_TR_ONE_CNT_IN798},
    {4u, 138u, P13_5, P13_5_TCPWM1_TR_ONE_CNT_IN138},
    {7u, 31u, P13_5, P13_5_TCPWM1_TR_ONE_CNT_IN799},
    {4u, 139u, P13_6, P13_6_TCPWM1_TR_ONE_CNT_IN139},
    {7u, 33u, P13_6, P13_6_TCPWM1_TR_ONE_CNT_IN801},
    {4u, 141u, P13_7, P13_7_TCPWM1_TR_ONE_CNT_IN141},
    {7u, 34u, P13_7, P13_7_TCPWM1_TR_ONE_CNT_IN802},
    {4u, 142u, P14_0, P14_0_TCPWM1_TR_ONE_CNT_IN142},
    {4u, 144u, P14_0, P14_0_TCPWM1_TR_ONE_CNT_IN144},
    {4u, 145u, P14_1, P14_1_TCPWM1_TR_ONE_CNT_IN145},
    {4u, 147u, P14_1, P14_1_TCPWM1_TR_ONE_CNT_IN147},
    {3u, 3u, P14_2, P14_2_TCPWM0_TR_ONE_CNT_IN771},
    {4u, 148u, P14_2, P14_2_TCPWM1_TR_ONE_CNT_IN148},
    {4u, 150u, P14_2, P14_2_TCPWM1_TR_ONE_CNT_IN150},
    {3u, 4u, P14_3, P14_3_TCPWM0_TR_ONE_CNT_IN772},
    {4u, 151u, P14_3, P14_3_TCPWM1_TR_ONE_CNT_IN151},
    {4u, 153u, P14_3, P14_3_TCPWM1_TR_ONE_CNT_IN153},
    {4u, 154u, P14_4, P14_4_TCPWM1_TR_ONE_CNT_IN154},
    {4u, 156u, P14_4, P14_4_TCPWM1_TR_ONE_CNT_IN156},
    {10u, 12u, P14_4, P14_4_TCPWM1_TR_ONE_CNT_IN1548},
    {4u, 157u, P14_5, P14_5_TCPWM1_TR_ONE_CNT_IN157},
    {4u, 159u, P14_5, P14_5_TCPWM1_TR_ONE_CNT_IN159},
    {10u, 13u, P14_5, P14_5_TCPWM1_TR_ONE_CNT_IN1549},
    {4u, 160u, P14_6, P14_6_TCPWM1_TR_ONE_CNT_IN160},
    {4u, 162u, P14_6, P14_6_TCPWM1_TR_ONE_CNT_IN162},
    {10u, 15u, P14_6, P14_6_TCPWM1_TR_ONE_CNT_IN1551},
    {4u, 163u, P14_7, P14_7_TCPWM1_TR_ONE_CNT_IN163},
    {4u, 165u, P14_7, P14_7_TCPWM1_TR_ONE_CNT_IN165},
    {10u, 16u, P14_7, P14_7_TCPWM1_TR_ONE_CNT_IN1552},
    {4u, 166u, P15_0, P15_0_TCPWM1_TR_ONE_CNT_IN166},
    {4u, 168u, P15_0, P15_0_TCPWM1_TR_ONE_CNT_IN168},
    {10u, 18u, P15_0, P15_0_TCPWM1_TR_ONE_CNT_IN1554},
    {4u, 169u, P15_1, P15_1_TCPWM1_TR_ONE_CNT_IN169},
    {4u, 171u, P15_1, P15_1_TCPWM1_TR_ONE_CNT_IN171},
    {10u, 19u, P15_1, P15_1_TCPWM1_TR_ONE_CNT_IN1555},
    {4u, 172u, P15_2, P15_2_TCPWM1_TR_ONE_CNT_IN172},
    {4u, 174u, P15_2, P15_2_TCPWM1_TR_ONE_CNT_IN174},
    {10u, 21u, P15_2, P15_2_TCPWM1_TR_ONE_CNT_IN1557},
    {4u, 175u, P15_3, P15_3_TCPWM1_TR_ONE_CNT_IN175},
    {4u, 177u, P15_3, P15_3_TCPWM1_TR_ONE_CNT_IN177},
    {10u, 22u, P15_3, P15_3_TCPWM1_TR_ONE_CNT_IN1558},
    {4u, 178u, P16_0, P16_0_TCPWM1_TR_ONE_CNT_IN178},
    {4u, 180u, P16_0, P16_0_TCPWM1_TR_ONE_CNT_IN180},
    {4u, 181u, P16_1, P16_1_TCPWM1_TR_ONE_CNT_IN181},
    {4u, 183u, P16_1, P16_1_TCPWM1_TR_ONE_CNT_IN183},
    {4u, 184u, P16_2, P16_2_TCPWM1_TR_ONE_CNT_IN184},
    {4u, 186u, P16_2, P16_2_TCPWM1_TR_ONE_CNT_IN186},
    {4u, 186u, P16_3, P16_3_TCPWM1_TR_ONE_CNT_IN186},
    {4u, 187u, P16_3, P16_3_TCPWM1_TR_ONE_CNT_IN187},
    {4u, 204u, P16_4, P16_4_TCPWM1_TR_ONE_CNT_IN204},
    {4u, 208u, P16_4, P16_4_TCPWM1_TR_ONE_CNT_IN208},
    {4u, 201u, P16_5, P16_5_TCPWM1_TR_ONE_CNT_IN201},
    {4u, 205u, P16_5, P16_5_TCPWM1_TR_ONE_CNT_IN205},
    {4u, 198u, P16_6, P16_6_TCPWM1_TR_ONE_CNT_IN198},
    {4u, 202u, P16_6, P16_6_TCPWM1_TR_ONE_CNT_IN202},
    {4u, 195u, P16_7, P16_7_TCPWM1_TR_ONE_CNT_IN195},
    {4u, 199u, P16_7, P16_7_TCPWM1_TR_ONE_CNT_IN199},
    {4u, 183u, P17_0, P17_0_TCPWM1_TR_ONE_CNT_IN183},
    {4u, 187u, P17_0, P17_0_TCPWM1_TR_ONE_CNT_IN187},
    {4u, 180u, P17_1, P17_1_TCPWM1_TR_ONE_CNT_IN180},
    {4u, 184u, P17_1, P17_1_TCPWM1_TR_ONE_CNT_IN184},
    {4u, 177u, P17_2, P17_2_TCPWM1_TR_ONE_CNT_IN177},
    {4u, 181u, P17_2, P17_2_TCPWM1_TR_ONE_CNT_IN181},
    {4u, 174u, P17_3, P17_3_TCPWM1_TR_ONE_CNT_IN174},
    {4u, 178u, P17_3, P17_3_TCPWM1_TR_ONE_CNT_IN178},
    {4u, 171u, P17_4, P17_4_TCPWM1_TR_ONE_CNT_IN171},
    {4u, 175u, P17_4, P17_4_TCPWM1_TR_ONE_CNT_IN175},
    {4u, 168u, P17_5, P17_5_TCPWM1_TR_ONE_CNT_IN168},
    {4u, 172u, P17_5, P17_5_TCPWM1_TR_ONE_CNT_IN172},
    {4u, 169u, P17_6, P17_6_TCPWM1_TR_ONE_CNT_IN169},
    {7u, 12u, P17_6, P17_6_TCPWM1_TR_ONE_CNT_IN780},
    {7u, 13u, P17_7, P17_7_TCPWM1_TR_ONE_CNT_IN781},
    {7u, 15u, P17_7, P17_7_TCPWM1_TR_ONE_CNT_IN783},
    {7u, 16u, P18_0, P18_0_TCPWM1_TR_ONE_CNT_IN784},
    {7u, 18u, P18_0, P18_0_TCPWM1_TR_ONE_CNT_IN786},
    {7u, 19u, P18_1, P18_1_TCPWM1_TR_ONE_CNT_IN787},
    {7u, 21u, P18_1, P18_1_TCPWM1_TR_ONE_CNT_IN789},
    {4u, 165u, P18_2, P18_2_TCPWM1_TR_ONE_CNT_IN165},
    {7u, 22u, P18_2, P18_2_TCPWM1_TR_ONE_CNT_IN790},
    {4u, 162u, P18_3, P18_3_TCPWM1_TR_ONE_CNT_IN162},
    {4u, 166u, P18_3, P18_3_TCPWM1_TR_ONE_CNT_IN166},
    {4u, 159u, P18_4, P18_4_TCPWM1_TR_ONE_CNT_IN159},
    {4u, 163u, P18_4, P18_4_TCPWM1_TR_ONE_CNT_IN163},
    {4u, 156u, P18_5, P18_5_TCPWM1_TR_ONE_CNT_IN156},
    {4u, 160u, P18_5, P18_5_TCPWM1_TR_ONE_CNT_IN160},
    {3u, 6u, P18_6, P18_6_TCPWM0_TR_ONE_CNT_IN774},
    {4u, 153u, P18_6, P18_6_TCPWM1_TR_ONE_CNT_IN153},
    {4u, 157u, P18_6, P18_6_TCPWM1_TR_ONE_CNT_IN157},
    {3u, 7u, P18_7, P18_7_TCPWM0_TR_ONE_CNT_IN775},
    {4u, 150u, P18_7, P18_7_TCPWM1_TR_ONE_CNT_IN150},
    {4u, 154u, P18_7, P18_7_TCPWM1_TR_ONE_CNT_IN154},
    {4u, 151u, P19_0, P19_0_TCPWM1_TR_ONE_CNT_IN151},
    {7u, 9u, P19_0, P19_0_TCPWM1_TR_ONE_CNT_IN777},
    {10u, 0u, P19_0, P19_0_TCPWM1_TR_ONE_CNT_IN1536},
    {4u, 78u, P19_1, P19_1_TCPWM1_TR_ONE_CNT_IN78},
    {7u, 10u, P19_1, P19_1_TCPWM1_TR_ONE_CNT_IN778},
    {10u, 1u, P19_1, P19_1_TCPWM1_TR_ONE_CNT_IN1537},
    {4u, 79u, P19_2, P19_2_TCPWM1_TR_ONE_CNT_IN79},
    {4u, 81u, P19_2, P19_2_TCPWM1_TR_ONE_CNT_IN81},
    {10u, 3u, P19_2, P19_2_TCPWM1_TR_ONE_CNT_IN1539},
    {4u, 82u, P19_3, P19_3_TCPWM1_TR_ONE_CNT_IN82},
    {4u, 84u, P19_3, P19_3_TCPWM1_TR_ONE_CNT_IN84},
    {10u, 4u, P19_3, P19_3_TCPWM1_TR_ONE_CNT_IN1540},
    {4u, 85u, P19_4, P19_4_TCPWM1_TR_ONE_CNT_IN85},
    {4u, 87u, P19_4, P19_4_TCPWM1_TR_ONE_CNT_IN87},
    {10u, 6u, P19_4, P19_4_TCPWM1_TR_ONE_CNT_IN1542},
    {4u, 88u, P20_0, P20_0_TCPWM1_TR_ONE_CNT_IN88},
    {4u, 90u, P20_0, P20_0_TCPWM1_TR_ONE_CNT_IN90},
    {10u, 7u, P20_0, P20_0_TCPWM1_TR_ONE_CNT_IN1543},
    {4u, 91u, P20_1, P20_1_TCPWM1_TR_ONE_CNT_IN91},
    {4u, 147u, P20_1, P20_1_TCPWM1_TR_ONE_CNT_IN147},
    {10u, 9u, P20_1, P20_1_TCPWM1_TR_ONE_CNT_IN1545},
    {4u, 144u, P20_2, P20_2_TCPWM1_TR_ONE_CNT_IN144},
    {4u, 148u, P20_2, P20_2_TCPWM1_TR_ONE_CNT_IN148},
    {10u, 10u, P20_2, P20_2_TCPWM1_TR_ONE_CNT_IN1546},
    {4u, 141u, P20_3, P20_3_TCPWM1_TR_ONE_CNT_IN141},
    {4u, 145u, P20_3, P20_3_TCPWM1_TR_ONE_CNT_IN145},
    {4u, 138u, P20_4, P20_4_TCPWM1_TR_ONE_CNT_IN138},
    {4u, 142u, P20_4, P20_4_TCPWM1_TR_ONE_CNT_IN142},
    {4u, 135u, P20_5, P20_5_TCPWM1_TR_ONE_CNT_IN135},
    {4u, 139u, P20_5, P20_5_TCPWM1_TR_ONE_CNT_IN139},
    {4u, 132u, P20_6, P20_6_TCPWM1_TR_ONE_CNT_IN132},
    {4u, 136u, P20_6, P20_6_TCPWM1_TR_ONE_CNT_IN136},
    {4u, 129u, P20_7, P20_7_TCPWM1_TR_ONE_CNT_IN129},
    {4u, 133u, P20_7, P20_7_TCPWM1_TR_ONE_CNT_IN133},
    {4u, 126u, P21_0, P21_0_TCPWM1_TR_ONE_CNT_IN126},
    {4u, 130u, P21_0, P21_0_TCPWM1_TR_ONE_CNT_IN130},
    {4u, 123u, P21_1, P21_1_TCPWM1_TR_ONE_CNT_IN123},
    {4u, 127u, P21_1, P21_1_TCPWM1_TR_ONE_CNT_IN127},
    {4u, 120u, P21_2, P21_2_TCPWM1_TR_ONE_CNT_IN120},
    {4u, 124u, P21_2, P21_2_TCPWM1_TR_ONE_CNT_IN124},
    {4u, 117u, P21_3, P21_3_TCPWM1_TR_ONE_CNT_IN117},
    {4u, 121u, P21_3, P21_3_TCPWM1_TR_ONE_CNT_IN121},
    {4u, 114u, P21_4, P21_4_TCPWM1_TR_ONE_CNT_IN114},
    {4u, 118u, P21_4, P21_4_TCPWM1_TR_ONE_CNT_IN118},
    {4u, 102u, P21_5, P21_5_TCPWM1_TR_ONE_CNT_IN102},
    {4u, 106u, P21_5, P21_5_TCPWM1_TR_ONE_CNT_IN106},
    {4u, 111u, P21_5, P21_5_TCPWM1_TR_ONE_CNT_IN111},
    {4u, 115u, P21_5, P21_5_TCPWM1_TR_ONE_CNT_IN115},
    {4u, 108u, P21_6, P21_6_TCPWM1_TR_ONE_CNT_IN108},
    {4u, 112u, P21_6, P21_6_TCPWM1_TR_ONE_CNT_IN112},
    {4u, 105u, P21_7, P21_7_TCPWM1_TR_ONE_CNT_IN105},
    {4u, 109u, P21_7, P21_7_TCPWM1_TR_ONE_CNT_IN109},
    {4u, 99u, P22_1, P22_1_TCPWM1_TR_ONE_CNT_IN99},
    {4u, 103u, P22_1, P22_1_TCPWM1_TR_ONE_CNT_IN103},
    {4u, 96u, P22_2, P22_2_TCPWM1_TR_ONE_CNT_IN96},
    {4u, 100u, P22_2, P22_2_TCPWM1_TR_ONE_CNT_IN100},
    {4u, 93u, P22_3, P22_3_TCPWM1_TR_ONE_CNT_IN93},
    {4u, 97u, P22_3, P22_3_TCPWM1_TR_ONE_CNT_IN97},
    {4u, 90u, P22_4, P22_4_TCPWM1_TR_ONE_CNT_IN90},
    {4u, 94u, P22_4, P22_4_TCPWM1_TR_ONE_CNT_IN94},
    {4u, 87u, P22_5, P22_5_TCPWM1_TR_ONE_CNT_IN87},
    {4u, 91u, P22_5, P22_5_TCPWM1_TR_ONE_CNT_IN91},
    {4u, 84u, P22_6, P22_6_TCPWM1_TR_ONE_CNT_IN84},
    {4u, 88u, P22_6, P22_6_TCPWM1_TR_ONE_CNT_IN88},
    {4u, 81u, P22_7, P22_7_TCPWM1_TR_ONE_CNT_IN81},
    {4u, 85u, P22_7, P22_7_TCPWM1_TR_ONE_CNT_IN85},
    {10u, 24u, P22_7, P22_7_TCPWM1_TR_ONE_CNT_IN1560},
    {4u, 82u, P23_0, P23_0_TCPWM1_TR_ONE_CNT_IN82},
    {7u, 24u, P23_0, P23_0_TCPWM1_TR_ONE_CNT_IN792},
    {10u, 25u, P23_0, P23_0_TCPWM1_TR_ONE_CNT_IN1561},
    {7u, 25u, P23_1, P23_1_TCPWM1_TR_ONE_CNT_IN793},
    {7u, 27u, P23_1, P23_1_TCPWM1_TR_ONE_CNT_IN795},
    {7u, 28u, P23_2, P23_2_TCPWM1_TR_ONE_CNT_IN796},
    {7u, 30u, P23_2, P23_2_TCPWM1_TR_ONE_CNT_IN798},
    {7u, 31u, P23_3, P23_3_TCPWM1_TR_ONE_CNT_IN799},
    {7u, 33u, P23_3, P23_3_TCPWM1_TR_ONE_CNT_IN801},
    {4u, 75u, P23_4, P23_4_TCPWM1_TR_ONE_CNT_IN75},
    {7u, 34u, P23_4, P23_4_TCPWM1_TR_ONE_CNT_IN802},
    {4u, 72u, P23_5, P23_5_TCPWM1_TR_ONE_CNT_IN72},
    {4u, 76u, P23_5, P23_5_TCPWM1_TR_ONE_CNT_IN76},
    {4u, 69u, P23_6, P23_6_TCPWM1_TR_ONE_CNT_IN69},
    {4u, 73u, P23_6, P23_6_TCPWM1_TR_ONE_CNT_IN73},
    {10u, 27u, P23_6, P23_6_TCPWM1_TR_ONE_CNT_IN1563},
    {4u, 66u, P23_7, P23_7_TCPWM1_TR_ONE_CNT_IN66},
    {4u, 70u, P23_7, P23_7_TCPWM1_TR_ONE_CNT_IN70},
    {10u, 28u, P23_7, P23_7_TCPWM1_TR_ONE_CNT_IN1564},
    {4u, 189u, P28_0, P28_0_TCPWM1_TR_ONE_CNT_IN189},
    {4u, 196u, P28_0, P28_0_TCPWM1_TR_ONE_CNT_IN196},
    {4u, 190u, P28_1, P28_1_TCPWM1_TR_ONE_CNT_IN190},
    {4u, 192u, P28_1, P28_1_TCPWM1_TR_ONE_CNT_IN192},
    {4u, 193u, P28_2, P28_2_TCPWM1_TR_ONE_CNT_IN193},
    {4u, 195u, P28_2, P28_2_TCPWM1_TR_ONE_CNT_IN195},
    {10u, 36u, P28_2, P28_2_TCPWM1_TR_ONE_CNT_IN1572},
    {4u, 196u, P28_3, P28_3_TCPWM1_TR_ONE_CNT_IN196},
    {4u, 198u, P28_3, P28_3_TCPWM1_TR_ONE_CNT_IN198},
    {10u, 37u, P28_3, P28_3_TCPWM1_TR_ONE_CNT_IN1573},
    {4u, 199u, P28_4, P28_4_TCPWM1_TR_ONE_CNT_IN199},
    {4u, 201u, P28_4, P28_4_TCPWM1_TR_ONE_CNT_IN201},
    {4u, 202u, P28_5, P28_5_TCPWM1_TR_ONE_CNT_IN202},
    {4u, 204u, P28_5, P28_5_TCPWM1_TR_ONE_CNT_IN204},
    {4u, 205u, P28_6, P28_6_TCPWM1_TR_ONE_CNT_IN205},
    {4u, 207u, P28_6, P28_6_TCPWM1_TR_ONE_CNT_IN207},
    {4u, 208u, P28_7, P28_7_TCPWM1_TR_ONE_CNT_IN208},
    {4u, 210u, P28_7, P28_7_TCPWM1_TR_ONE_CNT_IN210},
    {4u, 226u, P29_0, P29_0_TCPWM1_TR_ONE_CNT_IN226},
    {4u, 228u, P29_0, P29_0_TCPWM1_TR_ONE_CNT_IN228},
    {4u, 229u, P29_1, P29_1_TCPWM1_TR_ONE_CNT_IN229},
    {4u, 231u, P29_1, P29_1_TCPWM1_TR_ONE_CNT_IN231},
    {4u, 232u, P29_2, P29_2_TCPWM1_TR_ONE_CNT_IN232},
    {4u, 234u, P29_2, P29_2_TCPWM1_TR_ONE_CNT_IN234},
    {4u, 235u, P29_3, P29_3_TCPWM1_TR_ONE_CNT_IN235},
    {4u, 237u, P29_3, P29_3_TCPWM1_TR_ONE_CNT_IN237},
    {4u, 238u, P29_4, P29_4_TCPWM1_TR_ONE_CNT_IN238},
    {4u, 240u, P29_4, P29_4_TCPWM1_TR_ONE_CNT_IN240},
    {4u, 241u, P29_5, P29_5_TCPWM1_TR_ONE_CNT_IN241},
    {4u, 243u, P29_5, P29_5_TCPWM1_TR_ONE_CNT_IN243},
    {4u, 244u, P29_6, P29_6_TCPWM1_TR_ONE_CNT_IN244},
    {4u, 246u, P29_6, P29_6_TCPWM1_TR_ONE_CNT_IN246},
    {4u, 247u, P29_7, P29_7_TCPWM1_TR_ONE_CNT_IN247},
    {4u, 249u, P29_7, P29_7_TCPWM1_TR_ONE_CNT_IN249},
    {4u, 249u, P30_0, P30_0_TCPWM1_TR_ONE_CNT_IN249},
    {4u, 250u, P30_0, P30_0_TCPWM1_TR_ONE_CNT_IN250},
    {4u, 246u, P30_1, P30_1_TCPWM1_TR_ONE_CNT_IN246},
    {4u, 250u, P30_1, P30_1_TCPWM1_TR_ONE_CNT_IN250},
    {4u, 243u, P30_2, P30_2_TCPWM1_TR_ONE_CNT_IN243},
    {4u, 247u, P30_2, P30_2_TCPWM1_TR_ONE_CNT_IN247},
    {4u, 240u, P30_3, P30_3_TCPWM1_TR_ONE_CNT_IN240},
    {4u, 244u, P30_3, P30_3_TCPWM1_TR_ONE_CNT_IN244},
    {4u, 237u, P31_0, P31_0_TCPWM1_TR_ONE_CNT_IN237},
    {4u, 241u, P31_0, P31_0_TCPWM1_TR_ONE_CNT_IN241},
    {4u, 234u, P31_1, P31_1_TCPWM1_TR_ONE_CNT_IN234},
    {4u, 238u, P31_1, P31_1_TCPWM1_TR_ONE_CNT_IN238},
    {4u, 231u, P31_2, P31_2_TCPWM1_TR_ONE_CNT_IN231},
    {4u, 235u, P31_2, P31_2_TCPWM1_TR_ONE_CNT_IN235},
    {4u, 228u, P32_0, P32_0_TCPWM1_TR_ONE_CNT_IN228},
    {4u, 232u, P32_0, P32_0_TCPWM1_TR_ONE_CNT_IN232},
    {4u, 225u, P32_1, P32_1_TCPWM1_TR_ONE_CNT_IN225},
    {4u, 229u, P32_1, P32_1_TCPWM1_TR_ONE_CNT_IN229},
    {4u, 222u, P32_2, P32_2_TCPWM1_TR_ONE_CNT_IN222},
    {4u, 226u, P32_2, P32_2_TCPWM1_TR_ONE_CNT_IN226},
    {4u, 219u, P32_3, P32_3_TCPWM1_TR_ONE_CNT_IN219},
    {4u, 223u, P32_3, P32_3_TCPWM1_TR_ONE_CNT_IN223},
    {4u, 216u, P32_4, P32_4_TCPWM1_TR_ONE_CNT_IN216},
    {4u, 220u, P32_4, P32_4_TCPWM1_TR_ONE_CNT_IN220},
    {4u, 213u, P32_5, P32_5_TCPWM1_TR_ONE_CNT_IN213},
    {4u, 217u, P32_5, P32_5_TCPWM1_TR_ONE_CNT_IN217},
    {4u, 210u, P32_6, P32_6_TCPWM1_TR_ONE_CNT_IN210},
    {4u, 214u, P32_6, P32_6_TCPWM1_TR_ONE_CNT_IN214},
    {4u, 207u, P32_7, P32_7_TCPWM1_TR_ONE_CNT_IN207},
    {4u, 211u, P32_7, P32_7_TCPWM1_TR_ONE_CNT_IN211},
};

#endif
